#version: 0.2
Ġ Ġ
Ġ M
Ċ Ġ
Ġ =
Ġ A
I N
I A
R E
V IA
Ġ E
Ġ 0
Ġ <
T E
e r
ĠĠ ĠĠ
Ġ C
Ġ S
Ġ O
Ġ N
i n
Ġ (
Ġ >
n d
Ġ [
r e
S I
o f
u m
Ġ D
Ġ a
Ġ {
Ġ IN
E R
Ġ VIA
o n
D E
G E
t e
I O
ĠN O
P O
er r
U T
0 0
t h
ĠE X
RE A
P R
9 0
C T
Ġ um
O P
o l
Ġ RE
D GE
ĠA B
Ġ @
ĠAB UT
e nd
R A
L A
ĠNO T
t i
o w
Ġ 90
x t
te xt
| >
of text
end oftext
< |
Ġ B
A L
C H
A REA
Ġ L
T Y
SI DE
PR OP
i d
IN G
Ġ c
t o
ol t
V olt
E T
IO N
G ION
o r
Ġ err
a l
Ġ in
D M
Ġ> =
ĠC O
ĠRE GION
c e
L E
Ġ= =
1 0
Ġ s
in g
Ċ ĠĠ
t y
1 1
ĠIN TE
Ġ to
ĠĠĠĠ ĠĠĠĠ
E N
Ġ m
CH K
x d
ĠA N
ĠEX T
e d
Ġ of
l e
Ġ 1
T H
Ġ d
ĠO P
ĠOP PO
ĠOPPO SI
ĠOPPOSI TE
ĠE DGE
Ġ b
ti on
i s
) ]
RA CT
D N
ĠINTE RACT
S R
PROP ER
PROPER TY
1 2
r o
Ġ p
DM Y
F M
Ġ f
C A
ĠIN SIDE
Ġ V
e t
e c
e n
ĠA L
E DGE
LA Y
A TE
ĠD FM
LAY ER
I D
ĠN ET
i g
l ow
C B
Ġ -
) )
a n
Ġ G
Ġ T
p a
U LA
Ġ W
G LE
Ġ R
Ġ w
1 3
ĠE N
l a
L ow
C O
ig h
ĠS R
ĠB Y
Ġ n
TE N
Ġ PROPERTY
H igh
ĠO R
L O
C S
pa ce
Ġp ro
Ġ 2
E X
ĠĠ ĊĠ
Ġa nd
p er
L T
id th
Ġpro per
Ġproper ty
id e
Ġa re
Ġ is
L Y
1 5
Ġ< =
A N
ĠS ING
ULA R
ĠSING ULAR
ĠD M
G ATE
4 0
! !
ĠEX TEN
Ġn o
et al
, "
Ġ I
xd x
xd y
DE D
Ġ or
y n
s yn
re c
ĠAN D
ĠM y
l o
v e
ĠAL L
ĠC H
1 4
Ġno t
Ġ ^
S E
ĠEXTEN DED
M D
0 2
I P
Ġd i
D B
AL L
Ġ th
N ET
Ġare a
Ġa l
C D
6 0
Ġ ĊĠ
Ċ ĊĠ
RE F
M P
ĠO D
a t
N LY
g e
a r
ĠAN GLE
ĠO NLY
C C
OP Y
ĠC OPY
U M
Ġ ,
c h
ĠCO IN
E C
s t
Ġ F
C E
low ed
Ġal lowed
Ġth e
Ġdi rec
S O
Ġm u
Ġdirec tion
Ġ P
ĠA REA
8 0
Ġm etal
0 3
Ġ *
R ING
s i
ĠS E
ĠRE C
o u
0 5
AL RING
) *
O D
U P
4 5
x e
I TH
CD DMY
h i
E x
i tion
MP TY
PR L
ĠS pace
O T
ti ve
ĠSE ALRING
ĠM x
r an
ĠW ITH
ce p
hi p
" )]
cep t
ĠA CC
n g
Ċ ĠĠĠĠĠĠĠĠ
ĠEN C
Ġmu st
i th
U LT
ran ch
ĠĠĠĠ ĠĠ
D IO
ĠM ULT
ĠMULT I
ĠIN T
Ex cept
I M
Ġ X
Ġb e
O R
N OT
on n
Ġb y
u la
1 6
ĠCH IP
Ġ ]
RA M
1 8
ĠT CDDMY
onn ec
w idth
Ġ H
R ID
ĠR DB
V L
LO B
LOB AL
Ġ :
CO VL
U N
A D
NET ID
LOBAL NETID
Ġ le
Ġ e
RA T
Ġ "
e s
IN P
ĠCO N
Ġ PO
RAT IO
en si
ĠAL SO
e g
O N
ou nd
ensi ty
0 7
ar y
Ġs ide
Ġ RATIO
G TH
ound ary
" ,
Ġ ?
at ing
Ġf ol
Ġfol low
Ġ LAYER
lo ating
p re
TE D
N EC
NEC TED
Ġw ith
) +
u re
T M
A R
CT M
ĠC TM
P RE
Ġc o
N C
Y NC
H P
Ġs pace
Ġ- =
AN GLE
ĠC SR
ĠI COVL
t er
1 7
ĠV T
N g
M A
um ula
umula tive
U RE
S URE
UT SIDE
Ġ o
Ġc onnec
C SR
ĠO UTSIDE
5 0
2 0
ĠM E
re p
UN T
V ER
O M
CT ANGLE
h a
Ġ t
v er
ĠCON NECTED
Ġfollow ing
ĠB ranch
er s
s ide
A P
Ġ re
EN D
Ġ on
Ġ !!
ĠRE CTANGLE
L L
nd ition
ĠL UP
00 5
Ġco ndition
ec k
L N
Ġcondition s
R R
Ġw idth
lo s
c los
O G
Ġ +
ĠVIA y
ng th
ha p
0 80
C R
ĠO VER
1 00
) -
C MD
P T
i on
h eck
an g
C M
A CT
I Z
) /
i m
CE PT
ĠD UM
Ġ h
ĠS YNC
Ġin side
Ġ r
i a
or n
ĠĠĠĠ ĊĠ
P re
ĠO F
ed ge
ĠL EN
ĠLEN GTH
ĠC hip
xe x
Ġ( (
ĠF B
clos ure
xe y
E MPTY
C K
D O
ĠCO UNT
Ġ 45
l y
CT ING
ĠINTE R
ĠINTER SE
ĠINTERSE CTING
ĠĠĠĠ Ġ
ĠME A
ĠMEA SURE
Ġ PR
ĠOVER LA
ĠOVERLA P
I G
ing le
ĠE RR
ĠC B
Ġc orn
02 0
im um
ĊĠĠ Ġ
ĠG RID
ĠE MPTY
B oundary
2 4
Ġf or
e f
ĠEX C
r r
S RAM
L K
ĠM IM
a in
Ġ g
m p
S D
ĠS IZ
LT A
} }
mp ty
Ġc umulative
ĠNO D
ĠNOD AL
Ġle ngth
u p
C PO
to p
CO N
ĠCH K
a x
ĠOR TH
Ġc hip
ro m
p p
Ġside s
EC K
ĠE x
IG H
ĠM INP
Ġ l
EX T
ef in
d ow
V T
RE C
t s
0 60
M x
d ensity
IN SIDE
ĠACC UM
ĠACCUM ULA
ĠACCUMULA TE
N W
Ġs e
G LOBALNETID
efin ition
Ġm ain
ĠG LOBALNETID
Ġ )
ĠORTH OG
ĠORTHOG ON
ĠORTHOGON AL
ĠE y
CH ECK
ID TH
CH IP
o d
ĠD efinition
S T
NOT ATE
0 6
in dow
la y
Ġf loating
M IM
hap es
c al
Ġa ng
Ġang le
ĠS hapes
IN T
ĠB LK
w i
00 05
heck ed
N ER
Ġconnec t
re e
Ġ x
Ġ edge
t al
eg ree
Ġw indow
CA P
TE X
B AD
M y
d ge
M INP
th er
00 0
i z
O LTA
OLTA GE
in e
07 6
ĠW IDTH
ax imum
Ġse al
EX C
Ġd o
e l
w e
we en
et ween
P A
G RID
TEX T
ĠCO D
Ġd ensity
ĠR is
ĠRis k
Ġdo es
ĠT h
ti cal
ĠV OLTAGE
ĊĠĠ ĊĠ
Ġe mpty
ang le
g ion
E dge
Ġ &
ĠCB M
Ġto p
Ġb etween
B Y
Ġ lay
ĠC MA
ĠCMA CR
ĠCMACR O
ĠP P
ĠVIA x
n et
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
v p
vp M
O vpM
D V
ĠC M
Ġ& &
AN NOTATE
r i
Ġ 4
F loating
ĠT O
O LE
V ia
or iz
oriz on
orizon tal
c t
o g
PO LY
3 00
Ċ ĠĠĠĠĠĠ
Ġa t
_ _
a y
ter n
ĠENC LO
ĠS RAM
ĠNO EMPTY
ĠE n
at tern
ĠDM V
AN D
Ġp attern
Ċ ĊĠĠ
Ġre gion
ĠEX CEPT
Ġ[ !!
R P
Ġ[ -
( (
Ġl ine
R C
ĠMx a
Ġo ther
Ġcorn ers
CA i
u t
0 4
SI TY
Ġarea s
CB i
MA X
7 6
0 40
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
m y
A X
O OD
Q R
Ġh orizontal
ACT OR
CE LL
ĠM n
F ACTOR
r ing
M Y
ri angle
ĠD EN
Ġt riangle
M IN
S F
D F
E rr
Ġ[- =
Ġ{ {
B ranch
SI Z
03 00
ĠN W
SIZ E
ĠC PO
1 9
ĠM D
H OLE
Ġ en
ĠEn closure
ver tical
s e
q u
E L
PA CE
ĠM OM
TE P
IN F
INF ET
s ingle
b oundary
Ġ 3
Ġd egree
ĠS TEP
ĠĠ Ġ
ĠW idth
an ce
a re
P AND
~ (
R NER
Ġa n
ĠM aximum
M OM
ĠMy a
T CD
0 8
F I
B AR
ĠS QR
ĠN P
Ġf rom
ĠI SO
ĠD V
u le
Ġ rec
ĠNO P
ĠNOP SE
ĠNOPSE U
ĠNOPSEU DO
la g
Ġ ĊĠĠ
2 2
RE GION
2 5
Ċ Ċ
M er
m e
DN W
ĠG OOD
L DB
g ed
Ġ FM
a te
P i
T N
ĠSIZ ING
LE N
ĠI MD
V E
U CH
ĠTO UCH
ĠFM AX
ĠF INFET
LEN GTH
03 8
7 0
Ġ u
2 40
O J
ĠD C
W ide
DO W
EX CEPT
IN DOW
ĠPR OJ
ĠEMPTY i
M DMY
)* (
Ġrec t
ĠDEN SITY
Ġconnec tion
Ġa d
Ġen closure
m en
on al
Ġle ve
Ġleve l
D UM
ĠN MINP
O L
Ġ /
Ġor th
Ġorth og
Ġorthog onal
Ġr ule
um my
f f
ver la
s p
Mer ged
VIA y
ĠW INDOW
ĠSR M
verla p
12 0
Ġf lag
ec t
Ġ !
Ġ $
SI ON
PRE C
PREC I
PRECI SION
Ġ PRL
3 8
eg ion
ula r
qu are
LO W
pp ing
r id
ĠPR INT
ang ular
ĠSIZ E
Ġg rid
CB M
o th
C P
A CK
te pping
Ġ vertical
Ġa c
ĠD RC
EMPTY i
ĠB ACK
ĠBACK UP
ĠIN D
Ġg ate
R egion
05 0
d x
CO D
F B
l ti
d n
Ġmu lti
F GRID
ĠOF FGRID
l l
T IGH
S ingle
Single Via
Ġb ar
Ġ v
a me
ĠB AD
Ġs quare
Ġe x
F S
V G
O S
0 9
Ġs tepping
al l
c umulative
ĠC CP
up OvpM
upOvpM dn
ĠCO RNER
p le
men ts
Ġmulti ple
Ġs eg
Ġseg ments
15 0
g er
S ING
SING LE
u te
T OL
02 50
Ġangle s
Ġac ute
ĠLAYER S
) )]
S S
ĠV G
Ġin te
Ġinte ger
Ġpattern s
C ut
Ġrect angular
V i
3 0
Ġcorn er
c onnec
hap e
o si
)) ,
Ġo pp
Ġopp osi
Ġopposi te
ĠG ATE
ĠTh is
ĠS D
ĠL ay
T CDDMY
Ġon e
Ġs t
Ġc hecked
R ST
ER R
s hape
R DB
ĠP W
A CC
ĠM etal
Ġb oth
um b
L LE
R O
CON D
ĠP A
ĠLay ers
to r
connec ts
ec tive
a tion
ĠPA RA
ĠPARA LLE
ĠPARALLE L
V EX
FI LL
o od
ĠF I
)+ !
Ġre sp
Ġresp ective
LO CK
B LOCK
11 4
h or
ĠMy y
ĠD TCD
d y
M OS
ĠCHIP a
ol e
u ct
L UP
V C
hor t
r GATE
M n
2 1
i f
TIGH TEN
od e
ĠS PACE
f rom
ĠDUM MY
100 0
V MIN
V MAX
G T
ĠS LDB
Ġrespective ly
h k
S YNC
Ġr ing
re a
d e
Ġad d
W B
Ġst r
r t
3 4
3 60
Ċ ĊĊĠ
Ġlay er
02 00
ĠENCLO SURE
)) )
ĠV D
umb er
CH AR
CHAR GE
Ġn m
Ġconnection s
ĊĠĠĠĠĠĠ Ġ
t a
ĠBranch SingleVia
E W
Ġ2 0
ĠC hecked
UN D
Ġin ter
ĠG RP
el ta
ol ation
Ġdoes n
ou t
ĠR H
C hk
en t
ĠTh e
ow er
Ġ 5
Ġstr uct
Ġstruct ure
on CPO
N onCPO
O DE
Ġ IO
ĠM P
Ċ ĠĠĠĠ
w o
ĠEX PAND
ff ect
A B
RE S
ĠENCLO SE
!! !!
W F
> =
Ġh ole
ĠVIAx a
ĠL ower
ro up
07 5
Ġc on
ĠSRAM DMY
ĠE rr
ĠCHIP b
el l
a s
x Merged
on g
ti o
a tio
G RP
N D
l u
Ġ[ (
ance d
5 8
I F
Ġc heck
Ġc a
ĠVIAy a
ĠM top
h en
Ġ! =
0 15
Ġ( !
Ġr atio
Ġ 10
I E
ER GE
Ġe ffect
ĠG ND
ĠS H
ĠA CT
TE R
A T
ĠD NW
a ct
ĠL ar
ĠLar ge
ĠLarge N
ĠLargeN umber
Ġ if
L U
DM y
a st
Ġinter act
ĠD VIA
EX D
6 4
CO UNT
Ġf i
00 00
ĠL OG
ĠLOG O
w ith
ĠD ummy
te d
H IGH
in imum
L P
ĠĠ ĊĠĠ
n e
ĠC MD
R MDMY
pa c
1 40
I VE
C ell
ĠCSR DMY
EX PAND
ĠVIA top
c lu
V D
03 4
= =
DUM MY
ĠE C
l i
ĠAB S
VIA x
AB S
I COVL
le ngth
ĠEXTEN T
Ġd elta
Ġw hen
6 5
F LO
ĠM upOvpMdn
FLO AT
as Via
H asVia
05 8
Ġs ame
Ġl ong
ĠS F
ĠD F
Ġdi ode
al anced
Ġ ĊĠĠĠĠ
Mx a
ĠM z
G RO
FLOAT ING
CON NECTED
02 4
ĠT rGATE
N E
X P
A rea
O verlap
G roup
ĠV xMerged
j ec
ĠCON VEX
Ġle ast
2 7
Ġt s
Ġts m
Ġtsm c
Ġ Y
Ġ 50
m m
Ġal l
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠS hort
H E
)) *
ĊĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠĠ Ġ
ĠIND DMY
u r
2 8
ĠR MDMY
Ġadd ed
S PACE
L IN
)* !
ĠA P
ĠPW R
ĠA Pi
Ġ[ ~(
00 1
M etal
R ec
Ġca pac
Ġcapac i
Ġcapaci tor
a d
LU DE
Ġ U
ĠC rt
TH I
THI CK
THICK NE
THICKNE SS
ĠVT S
Ġno de
Ġb alanced
S Z
)* !!
ĠV C
6 3
Ġlay ers
ĠEXC LUDE
FS MIN
FS MAX
Ġ(( (
n m
EW XP
ĠSH I
ĠSHI EL
ĠSHIEL DED
P P
Ġo verlap
EX TEN
D RC
ĠPO LY
G O
a se
ĠEXTENT S
Ġcon s
ĠVT U
Ġ Z
is t
d egree
err or
T I
le ase
IN TE
a ge
m etal
ĠR Vi
EXTEN T
INTE RACT
ĠM ERGE
u tive
ec utive
W DMY
IN D
D TCD
Ġerr or
ĠAN T
DE N
CAi i
E F
ol or
SE ALRING
Ġ 8
END IF
o re
mm end
o mmend
Ġc olor
D VIA
CHIP a
EL SE
Ġd ummy
ne w
6 2
ĠM r
ĠC E
ĠCE LL
AD ER
ĠG ood
o t
ĠVIAy y
SD c
ĠVIA z
2 3
Ġcons ecutive
| |
ĠM inimum
Ġon ly
ur n
LIN E
J T
Ġv ia
SE COND
FI RST
Ġt urn
CMD i
SR M
DM z
ĠP lease
CBi i
Ġflag s
DV y
T AL
OR IZ
ORIZ ON
ORIZON TAL
ĠMx R
RA P
H V
G ood
2 9
R V
n ot
ce n
ĠH ORIZONTAL
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠDM n
ĠV ER
ĠSE COND
ĠFI RST
B JT
m b
ĠV ia
o nd
V x
se mb
semb ly
s sembly
2 60
r a
ĠA ssembly
O UND
06 00
A IVE
S LDB
Ġ ||
B ig
B LK
B OUND
m all
02 2
AP i
N O
03 15
T OM
ommend ed
ĠB OT
ĠBOT TOM
c tion
00 20
3 5
) .
P AD
ĠMOM DMY
ĠGood Branch
ĠB ad
Ġv i
12 00
0 11
VIA n
S CR
CO RNER
Ġ end
CON CA
VIA z
ff er
0 1
F U
te n
CONCA VE
C WDMY
)/ (
Ġis olation
Ġu s
D FM
M upOvpMdn
CO RE
00 4
ĠFI X
VT S
12 4
3 2
ith er
Ġvi olation
ĠE mpty
TI C
TIC AL
U VIA
s ame
F IN
04 00
ch k
DM D
BOUND AR
BOUNDAR Y
Ġco ver
ĠB CWDMY
E D
!!!! <|
j a
ja cen
jacen t
Ġ ĊĠĠĠĠĠĠĠĠ
IGH T
ĠĠĠĠĠĠ ĊĠĠ
ĠR IGHT
Ġ ĊĠĠĠ
IN NER
ĠL EF
ĠLEF T
Ġ 40
ol er
11 2
ĠFIX ED
oler ance
02 8
ĠVER TICAL
ĠF or
UND ER
ĠT OP
si on
Ġlay out
ten sion
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġp la
ĠCHIP x
VT U
U i
Ġp re
clu de
ĠCTM DMY
Ġf u
AN ODE
Y P
05 7
R M
D C
m aximum
0 100
CC P
ĠOD c
2 6
ĊĊ ĊĊĠ
L V
Ġ1 80
R Vi
u al
Ġturn ing
ĠT PO
FIN AL
CON VEX
ĠA ction
n er
v ent
GO X
Ġpre vent
ra w
DEN SITY
Ġt olerance
Ġ+ -
03 65
ĠT R
U R
ĠB V
Ġin ner
6 000
D PO
M top
E SD
li ty
Ġus ed
Ġa f
Ġaf ter
)*!! (
Ġu n
G ER
d en
NO CAP
IE DMY
3 1
UR CE
SO URCE
IG GER
E y
u n
Ġ ha
b id
ist ance
TH ODE
ĠDV PA
ĠDVPA RAM
ĠDVPARAM S
ĠAN NOTATE
VC i
ĠTR IGGER
f or
ĠS T
N MINP
R H
ĠI BJT
ĠA ll
N P
09 5
00 10
Ġu ti
15 2
Ġfi ll
Ġad jacent
w all
Ġuti lity
DV z
06 4
Ġa s
bid den
My y
GRO UP
L R
Ġ2 5
2 70
en ter
Ġth at
07 0
Ġfill ing
ĠDM y
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ġ1 62
W ITH
S A
ĠMy x
c k
ĠH IA
on e
ĠM ax
Ġ1 000
s id
] }
) ,
11 40
VT L
ĠCrt PO
Ġs hort
ĠC UT
EN C
R IN
RIN K
ĠVIA r
06 2
ĠĠ ĊĠĠĊĠ
ĠD E
Ġ 9
7 5
Ġpla te
T rGATE
b le
FU SE
o ther
ĠB CM
Ġn e
ĠPP Ui
)+ ((
r Boundary
P C
0 16
ĠST RAP
Ġd istance
ĠH V
ĠS CR
EN TER
Ġn et
TN B
Ġp o
OD c
ST Pi
ce d
ch ing
Ċ ĠĠĠĠĠ
ĠG RO
ĠA t
in t
VG i
Ġfollow s
ĠC A
d my
07 60
HOLE S
i t
Ġun B
Ġth is
ĠD UVIA
ĠT IE
ĠA rea
GRO W
ĠunB al
EL i
ffer ent
ĠS VIA
ĠVIA n
c a
B M
Ġex tension
h v
ĠĠĠĠĠĠĠĠ ĠĠ
ĠIBJT DMY
VIAy y
RA Y
AR RAY
ca ve
Ġin jec
Ġinjec tor
04 7
0 90
Ġfu l
Ġful ly
VD i
03 0
Ġ{{ {
ĠE W
16 2
3 3
Ġc an
ĠE SD
EW YP
g th
en gth
D I
ĠL ength
Ġ 112
ou ter
Ġfor m
2 0000
a ch
)+! ~(
ĠCON D
Ġw i
Ġwi ll
ĠM AX
Ġ{ @
ĠPR BOUNDARY
ual ly
M z
ĠEC y
ĠEC x
CA THODE
an ually
% )
} ]
ĠB PO
clu d
ĠVIAx s
w ay
ĠF S
U TER
Ġ ĊĠĠĠĠĠĠ
8 4
DE LTA
Ġ1 00
Ġ3 6000
ĠR ec
u ar
uar d
)*! ~(
O UTER
ĠGRP dy
ĠGRP dx
ĠP ACT
VTU L
< =
( )-
ĠVT LN
are a
ĠDE LTA
sp ond
spond ing
re sponding
or responding
im un
H IA
ĠH E
ĠHE ADER
orn er
NW i
Ġrect angle
Mtop N
Ġd raw
D OD
Ġc onn
Ġconn n
Ġconnn ec
Ġconnnec ted
i re
AN T
Ġt wo
S H
VIAx a
ĠVD i
Ġre qu
Ġrequ ire
ĠVG i
Ġa b
Ġcheck s
45 00
Ġseal ring
ĠR e
ĠP AD
M ore
Ġ2 70
)+! (
Ġside wall
ĠVIAy x
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
e ither
Ċ ĊĊĠĠ
ĠRec ommended
)) /
ĠPO DE
W IN
Ġa way
f ect
ef fect
M r
u se
T h
ĠGRO W
5 00
in for
infor ced
G OOD
HE ADER
D A
00 8
ĠORTH O
RMDMY n
Ġwindow s
with out
Ġ ĊĊĠ
Ġ1 0000
x a
ĠNW DMY
Ġ lo
Ġwith in
ĠVTS N
P W
OR G
} )
My a
M ERGE
ĠVTU LN
B C
Ġ ran
Ġran ge
IND DMY
1 80
W AIVE
ĠVT LP
Ġ UNDER
ĠUNDER O
ĠUNDERO VER
SD I
f lag
s s
ĠW AIVE
Ġ ~(
ĠCH B
Ġpro jec
Ġab ut
08 00
ĠB al
Ġ y
J OG
SRAM DMY
ĠFor bidden
ĠNW i
ĠD IA
ĠACT IVE
Ġse ar
Ġsear ching
g uard
CB p
CA p
3 6
ĠSD I
Ġ #
O Z
K OZ
Branch SingleVia
9 00
Low er
DIO DE
VIA r
CPO DE
ĠC heck
CHIP x
Ġs h
or ing
igh b
ighb oring
14 00
6 1
Ġ up
rr ay
ON UT
E mpty
ĠU BM
LV MOS
Ġa rray
10 1
05 00
ĠMax imun
05 6
S CHARGE
DI SCHARGE
ĠI P
ĠD ONUT
EN T
Ġm anually
Ġcover ed
ĠM FUSE
ow n
Ġcheck ing
ĠVTU LP
s si
Ġpo ssi
ĠĠĠĠĠĠĠĠ Ġ
ĠVTS P
DV r
DM r
V IEDMY
ĠH OLE
ĠM u
] .
00 2
M ET
ĠMx s
Ġ ~
5 000
men t
ĠF loating
d elta
Ġ[ !
CTM DMY
Ġex cept
Ġlo cal
P ACT
dow n
RE CTANGLE
ĠP SDc
DMy y
ĠM Pi
5 3
Ġpossi ble
PP I
Ġprojec ted
8 1
ty p
Ġ ĊĠĠĊĠ
DNW R
AR N
Ġ id
Ġid en
Ġiden tical
Ġm od
Ġmod if
Ġto tal
Ġ j
PO DE
u ce
5 5
Ġin to
P ER
ĠC ENTER
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
W IDTH
] ]
ĠCH ECK
u g
ĠEXTEN D
m g
ch eck
tion s
ou l
oul d
Ġ low
Ġs ug
Ġsug ge
Ġsugge s
Ġsugges tions
Ġm inimum
8 000
Ġm ore
m ain
W ARN
S RE
Ġe ach
ST P
ĠX X
ĠXX X
v i
ig ure
EXC L
5 7
1 60
E P
B CM
Ġa pp
Ġv olt
Ġvolt age
T AP
SRE Z
. >=
ĠCrt MD
Ġmodif y
Ġha s
Ġm ay
9 8
Ġsh ould
ĠS LR
)/ ((
Ġc enter
ĠMy z
} ,
VIAy a
xey i
xex i
LO D
0 10
clos ed
DE F
Ġ: (
Ġapp li
Ġne ighboring
0 19
S QR
S K
Ġd own
re gion
04 30
Ġan y
r ain
H S
ĠSH RINK
) }
Th is
Ġo p
Ġs mall
Ġcon cave
ĠN SDc
Ġ8 000
u nd
ĠIN NER
ĠV AR
Mer ge
H INT
Ġj og
01 10
Ġp rBoundary
Ġmetal s
Ġconnec ted
N MOS
ĠAN ARRAY
o ve
06 6
05 4
ĠVC i
Ġ KOZ
at a
5 4
0 45
C hecked
ĠI s
ĠC AD
Ġg roup
TIGH T
ĠPW ELi
T CH
Ġdi fferent
ĠA d
h ole
Ġn umber
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ck age
ĠB CMD
M W
Ġha ve
WARN ING
09 4
S pace
ata typ
Ġ( !!
PER IM
4 8
Ġca use
Ġb lo
Ġblo ckage
ĊĠĠ ĊĊĠ
V xMerged
ĠC orner
Ġh ol
Ġhol es
LO GO
LE SS
ST RAP
e q
PO OL
EX P
er ged
SR DMD
03 80
Ġ ti
a i
ĠP M
ĠOVER UNDER
T PO
02 6
Ġ5 000
Ġ2 7
ĠS mall
0 150
la tive
] )
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
RE L
M AND
MAND REL
S LR
8 7
ĠHOLE S
ĠĊĠĠĠĠĠĠĠĠ ĠĠ
ĠAL LOD
la nd
ĠAB SO
ĠABSO LU
ĠABSOLU TE
ou r
00 50
Ġc orresponding
Ġw hi
Ġop tion
Vx CA
02 60
E TER
F INFET
R W
06 8
l ine
en ce
Ġappli ed
Ġ outer
SE G
HV MOS
25 2
MET A
T RA
TRA CK
PERIM ETER
check ing
MA SK
ĠĠĠĠ ĊĠĠ
ĠO ver
ĠOver lay
ĠMAX IM
ĠMAXIM UM
00 70
DMy x
ĠN ACT
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
m ove
25 8
C rt
MP i
DV SS
07 20
a nd
ĠC u
My x
Ġdraw ing
Ġ1 4
Ġform ed
ĠCTM FINAL
09 00
6 8
ĠEn closed
V AR
Ġth an
Ġex clude
ĠA y
ĠA x
C enter
ĠP MOS
ĠI LP
ON E
5 1
SH RINK
03 6
Ġin clude
Ġd e
Ġ5 6
Ġrequire ment
F igure
Ġin clud
p rBoundary
IGH B
IGHB OR
Ġd atatyp
B V
25 9
25 3
Ġb ent
Z ONE
Ġinter s
N G
IF DEF
ĠFS x
O UT
4 00
Ġe ither
ĠR V
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
TN c
M ENT
ĠCPO DE
07 40
ĠU n
ĠC on
RA W
D TN
LO NG
Ġwhi le
Ġco re
ĠMy R
w ia
wia ve
Vx CB
ro ss
ol y
iz e
ĠR ed
F O
Ġ ))
p ro
Ġb ranch
Ġu nd
Ġund er
Ġre d
Ġred uce
Ġexclude RR
ĠexcludeRR ule
ĠexcludeRRule Rec
ĠexcludeRRuleRec ommended
02 80
Ġ it
. .
Ġm erged
IO DMY
Ġinters ect
Ġintersect ing
ĠRe inforced
ĠFS y
Ġh igh
Ġ100 000
Ġan al
Ġanal og
Ġ1 20000
ĊĊ ĊĊĊĠ
PW ELi
N ACT
pac ing
Ġs pacing
DVy y
Ġedge s
Ġan other
i fferent
P SD
Ġti me
our ce
u ch
] ,
ĠE dge
Ġdi ffer
Ġdiffer ence
n ode
ĠM OS
ĠE ST
54 900
vi ce
07 00
y p
w yp
pa rt
)+ !!
Ġfi x
VIAy x
- ((
ĠI f
Ġ z
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠG LOBAL
Edge H
Ġz one
en se
Ġbe low
is e
j u
My z
ĠGLOBAL X
ĠGLOBALX Y
ĠRMDMY n
ĠMn s
Ġno ise
Ġcenter line
18 00
ĠB VG
m ax
)+ (
02 30
4 2
ai ve
Ġp oly
Ġh int
Ġh el
Ġhel p
Ġfix ing
ĠO ut
ĠOut p
ĠOutp ut
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ju st
20 1
VIAy z
LO SE
ENC LOSE
S mall
M E
ĠA A
VIA top
3 7
9 4
Ġ ĊĊ
Ġde vice
ĠD EF
03 70
t angular
rec tangular
Ġen h
Ġenh anced
d rain
08 9
ĠX OR
o me
6 60
ĠI FO
Ġ 75
th ode
U MP
11 5
04 4
02 10
C ENTER
B UMP
2 00
Ġs ome
pro d
prod uct
2 10
Ġfi r
Ġfir st
Ġs ource
MOM DMY
ĠLUP IEDMY
))] )
9 6
ou n
Ġex clud
R I
D UVIA
ĠĠ ĊĠĠĠ
th e
H i
Ġwith out
SEG MENT
Ġrequire d
Ġp ad
ĠSmall J
ĠSmallJ og
ĠShort Ex
ĠShortEx p
Ġ3 0
C DM
ĠRe move
ĠL V
ĠD IODMY
ĠAd d
y CBp
y CAp
x CBp
x CAp
ĠVD DVSS
Ġ2 10
a thode
ĠN MOS
ĊĠĠĠĠĠĠĠĠ ĠĠ
)* ((
( ))]
c orresponding
29 40
Mx R
Ġdraw n
Ġre inforced
I MP
f i
/ ^
ĠT o
GATE c
DEN SE
8 55
Ġinclud ing
ĠC athode
Ġ Volt
ĠVolt age
b oth
7 4
Ġex is
27 8
06 40
ĠD ensity
ĠV x
ĠR W
c ond
a ble
LO R
CO LOR
B PO
Ġ8 00
ĠAN S
ĠAN M
ĠAN HS
I TCH
16 00
P M
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
Ġen clos
Ġenclos e
V OLTAGE
Ġm aximum
m i
ĠG VIA
ĠAN ODE
ro und
ĠG M
M FUSE
ĠĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠH INT
M J
- /
ĠĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠD ense
G A
02 1
Ġ{ (
Ġexclud ed
ĠSR DOD
O NLY
ĠL C
ĠDM z
e x
OR T
LIN K
24 00
ĠI t
18 6
18 9
2 000
ĠS SD
pa nd
Ġco mm
ĠV max
ĠS ide
ĠSide wall
Ġ 80
Ġ )/
07 4
Ġa v
Ġav o
Ġavo id
qu al
e mi
4 1
Ġb ut
w indow
25 10
I C
06 20
um i
umi lative
c umilative
27 9
Ġfor bidden
ĠVOLTAGE S
ĠSR DPO
ĠDEF A
ĠDEFA ULT
Ġc oun
RI VER
D RIVER
Ġto uch
ĠHIA DMY
1 10
04 90
ĠN STPi
efin ed
S ize
ĠS S
ĠSS C
b alanced
ĠDM x
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
pand ing
LO G
LOG IC
VD D
SR DPO
W aive
ĠIs o
ĠCBM W
ĠA R
VTU LN
Ġex ist
I BJT
D ER
d p
ĠOD n
DVy x
Ġ0 0
15 00
Ġn umb
Ġnumb ers
ĠD CPODE
Ġpo int
Ġe qual
ĠEx cept
Ġex panding
rt ual
Ġdatatyp e
ĠE ach
27 2
0 18
S L
ĠCTM W
09 40
) }}
Ġ out
L g
Ġac ross
{ {
L C
HE AL
HEAL TH
15 6
Ġfi le
Ġcomm and
ĠS TI
I s
H OR
ĠDEN SE
ME AR
27 3
Ġfu ll
13 00
Ġ1 5
ro jec
P rojec
N A
P ITCH
Ġp ure
Ġpure M
MANDREL S
13 40
V A
ĠĠĠĠĠĠĠĠ ĠĠĠ
Ġregion s
Ġ i
ri tical
ĠPO W
Ġ 6
F PO
8 8
v en
f in
Ġd efined
ĠC umulative
Ġout side
T IE
LA T
I DE
VTS N
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
. )
ĠT PC
is o
CA D
Ġ1 2
ĠW hen
ĠO ne
03 5
)*( !!
ĠCon cave
ĠVTU L
ĠR P
ĠRP DMY
ĠOD S
o int
l ter
I R
C ritical
Ġm in
Ġm at
Ġmat ching
Ġc ell
ĠD y
ĠD x
)) )*!~(
fi lter
W A
LAT TEN
LA ST
Ġm e
ĠMP C
ĠEW YP
O ne
I L
d ifferent
SH ORT
05 70
Ġstr a
Is land
1 90
Ġo ver
Edge V
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
Ġd my
W INDOW
ĠĠ ĠĊĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĊĠ
Ġt ra
Ġtra ck
ĠP oint
Ġ1 8
00 80
Ġexis ts
an t
01 90
PO B
Mx CA
00 30
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠ
D RAW
07 1
04 10
ĠĠ ĊĊĠ
P STPi
Mxa CA
P SDc
Ġ 7
b etween
CENTER LINE
ĠErr y
ĠErr x
ĠDM r
d ist
Ġy ou
Ġp ar
V al
Ġfile s
Ġdirec tor
Ġdirector y
ĠMx CB
ĠAN TEN
ĠANTEN NA
U LE
R ULE
u e
p in
ERR OR
Ġb oundary
s pace
Val ue
s el
Ġal ong
v ia
U O
01 80
ĠB PC
IF O
ĠN E
ĠNE IGHBOR
ĠCA THODE
G B
F use
T OP
E ST
))* !
))*! ~(
Ġ '
B VG
ĠVER TEX
Ġ9 20000
Ġ2 20000
Ġstra it
ĠFI LL
FU LL
ĠUn balanced
ĠH orizontal
P in
09 50
00 9
Ġpar al
Ġparal le
Ġparalle l
03 10
ĠRH TNc
VT LN
DMy a
DM xa
DM x
ĠU se
ĠMetal Fuse
U BM
06 3
Ġis land
ĠR ule
ĠANGLE D
T able
Ġo per
ĠRule Table
ĠRed und
ĠRedund ant
I LP
Ġlength s
ĠG RA
ĠGRA DI
ĠGRADI ENT
089 5
CBM FINAL
ĠS RE
ĠSRE SD
ĠL ine
G C
05 60
Ġchip b
Ġc hi
Ġchi pa
ĠUse prBoundary
7 00
Ġpoly g
Ġpolyg on
ĠEW XP
V EL
19 00
07 2
06 50
p lu
plu g
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
Ġrec ommended
ĠB y
ĠA n
ĠAn y
l t
ĠB x
D ACT
04 70
03 3
ĠP STPi
i r
V SS
SS C
Projec tion
D CPO
Ġne ed
Ġcoun ts
ĠM ed
LE CT
ĠPW EL
Crt PO
12 2
Ġs p
Ġsp ec
4 000
e D
U IDE
G UIDE
ĠCB D
cen ter
Ġ 6000
e wyp
ĠSR POLY
Ġ Ċ
nm dp
nmdp c
ĠP TAP
ĠN TAP
My R
EXCEPT x
ĠDMy y
ĠCO RE
A y
A x
ĠVIAy z
ĠMD i
ĠDMn EXCL
i SRAM
e st
BLOCK i
u lt
n el
an nel
Ġpla ced
ĠL ast
ĠF LATTEN
PT AP
ĠRE F
12 6
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
11 3
Ġneed s
u s
g ate
DNW i
Ġy a
Ġx a
in clude
Ġoper ating
ĠN et
i al
Ġb ond
03 25
.. .
Ġdi e
ĠE ffect
NE IGHBOR
Ġspec ial
ĠSE LECT
ĠPO ST
ĠM IN
ĠGRO UP
Ġ2 20
Th e
DM V
ĠP C
ĠPC L
RH TNc
P MOS
06 60
Ġc hk
^ (
^( -
* ((
)) )+
) ^(-
Ġu se
x p
w xp
P L
O UTSIDE
Ġs ty
Ġsty le
ĠCMD i
MA TCH
IN E
6 7
ĠPO DER
CAP DMY
9 1
ĠR R
V IR
VIR T
B OT
N STPi
ĠUn f
ĠUnf ri
ĠUnfri end
ĠUnfriend ly
ĠRed uce
ĠM anually
lay ers
10 80
10 8
04 6
ĠB oth
ur round
Ġconnec ts
MATCH ING
CP L
A node
08 20
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
G L
ĠN TN
RST I
E Q
ĠH D
ST I
Ġs urround
Ġre lative
ĠG ate
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
raw ing
d rawing
P IN
AB LE
13 0
0 17
to m
PO M
CB dy
CB dx
CA dy
CA dx
OD DA
ĠVT L
ĠPO DN
ĠD COD
CMD n
4 25
3 12
Ġidentical ly
ĠN T
r p
G rp
DMy z
12 40
08 2
Ġe wyp
ĠO verlap
Ġf in
ĠSING LE
ĠR c
re l
l v
and rel
VIAn A
Mn A
M andrel
00 40
Ġvia s
er e
S emi
I SO
36 00
300 000
3 000
00 90
Ġrec og
Ġrecog n
ĠS VxCB
VTS P
45 0
22 80
Ġc ut
li c
SR DOD
Ġs ensi
Ġsensi tive
ĠPO R
ĠMx CA
ĠD RAW
ĠD ACT
MET AL
A ll
Ġ1 7
ir c
irc u
IP D
3 50
ĠEXCEPT ION
29 2
11 00
Ġle ss
ircu it
02 40
ĠM AT
ĠMAT CH
ĠMATCH ING
ĠAd jacent
x W
xW dx
xWdx L
xWdxL d
CB D
100 00
xdy i
xdx i
C u
ĠĠĠĠĠĠ ĠĊĠĠ
ĠĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠTo tal
ĠO n
3 18
29 9
Ġgate s
EXP c
3 13
Ġne are
Ġneare st
IO VSS
E CT
02 65
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
Ġc us
Ġcus tom
te m
CH B
3 19
29 8
29 3
ĠVx CB
ĠMxa CB
i ck
Ġ 65
B y
B x
Ġbar s
5 2
ĠU p
ĠUp per
ĠOn ly
s tepping
05 90
ĠR egion
ĠM up
ĠM dn
ĠDMy a
Vi rtual
Group s
G TE
E GTE
ĠDE CAPDMY
Ġ1 9
06 80
03 40
ĠF PSTPi
Ġ High
ĠHigh ly
NOT CH
ĠĠ ĊĊĊĊĊĠ
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
L OP
3 9
ĠCBM FINAL
25 5
09 9
ĠS LV
DVy a
DV xa
DV x
ĠWAIVE ABLE
ĠNO U
ĠNOU SE
ĠG Merge
T ION
OP TION
ĠSE L
ĠDNW i
67 1
55 6
Ġ8 5
iz ing
080 5
08 70
Ġs izing
Ġpolygon s
}} }}
iz ed
pa d
er tical
c orner
MP C
Crt MD
Ġ( {
Ġdatatyp es
ĠPO i
}} },
te ction
U S
US ER
RO UND
N TAP
Ġs ingle
ĠEx tension
ĊĠ ĊĠ
}} ,
5 0000
T PC
D CMD
03 20
Ġrecogn ized
ĠOD i
si ve
B CMD
ĠVG n
ĠVD n
C orner
) :
~ ((
Mxa CB
L ast
B PC
ĠERR OR
05 80
04 9
ĠPO M
ĠD i
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġd x
ĠODc s
PP Ui
ĠF igure
ĠĠĠĠ ĊĠĠĠ
ĠB E
o st
V n
MD i
04 8
03 50
Ġg uard
ĠPWEL n
02 45
ĠP STP
as k
DIO DMY
Ġthe se
ĠSR DMD
Ġ LAST
Region x
11 20
ĠĠĠĠ ĊĠĠĠĠĠĠ
ĠD raw
NW DMY
02 5
ĠFILL ER
O VL
02 05
Ġr un
Ġm ost
Ġbe side
ĠA node
C hip
Ġ{{{ {
m ation
Mx CB
DM n
AN ARRAY
76 5
13 50
ĠS L
ĠRW i
L ine
Ġcumulative ly
ĠLUP WDMY
ĠDraw n
D ifferent
18 12
04 40
Ġd efinition
ĠPW STRAP
ĠCrt CMD
L eD
Ġe ven
ĠS ingle
ĠNW RSTI
ĠDi ode
CMD S
06 5
04 60
Ġus age
Ġthe m
Ġthem sel
Ġthemsel ve
Ġthemselve s
Ġcustom ers
ĠNW STRAP
G N
DM P
4 7
19 2
ĠA c
Ġ1 3
c p
S M
N SD
06 1
Ġ text
4 4
ĠG COD
Region y
2 80
) ;
ĠAc tive
Ġ la
VIAx y
VIAx c
en closure
F C
045 0
Ġfi l
Ġfil m
ĠE LK
ĠDy CB
ĠDy CA
ĠDx CB
ĠDx CA
F i
Ġstructure s
Ġp ick
Ġd up
Ġdup lic
Ġduplic ate
ĠMu st
ĠIs olation
Ġ JOG
)) -
Ġabut ment
ĠP SD
ĠNP i
ĠL INE
19 20
17 90
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ġme an
P Pi
N Pi
9 000
03 9
Ġ2 9
ĊĊ ĊĊĊĊĊĠ
ate d
DVy z
15 12
ĠĠĠ ĊĠĠĊĠ
Ġc ircuit
Ġ+ !
i um
e p
Ġex clu
h annel
REGION x
OL BLK
17 1
3 30
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġexclu sive
ĠS emi
ĊĊ ĊĊĊĊĠ
Ex tension
E MOS
14 5
PO i
CHK c
17 9
02 7
ĠĊĠĠĠĠĠĠĠĠ ĠĠĠ
ĠVC n
ĠDVIA x
W i
C on
7 200
23 1
Ġoverlap s
Ġin for
Ġinfor mation
ĠUBM i
ĠDM xa
ĠC RAM
FILL ER
05 30
)}} }
ou s
4 90
18 90
Ġp ower
ĠS ame
Ġ K
RAT ING
LE VEL
G RATING
EN MOS
" ))
Ġp lease
Ġconnect ing
12 60
ĠMxa CA
t ch
VTULN i
VTUL Pi
VTSN i
VTS Pi
VTLN i
VTL Pi
S MIN
S MAX
OD j
OD i
N SDc
6 30
00 034
ĠĠĠĠ ĊĊĠ
Ġs wi
Ġswi tch
ĠS Q
ĠSQ U
ĠSQU A
ĠSRDMD i
H orizontal
08 40
0 12
CMD is
017 5
Ġs ize
ĠCB i
VD DVSS
ĠSQUA RE
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
21 90
Ġre move
ĠS VxCA
as s
W PO
S SD
P HIA
NO I
NOI SE
N HIA
Ġ{{{ {{
ĠNW n
ne ighboring
d istance
PO R
03 60
5 6
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġen closed
ĠRE G
ĠT IN
ĠN STP
p end
Ġt a
Ġmean s
ĠVx CA
ĊĊ Ċ
TE DMY
J TEDMY
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠS quare
ĠME D
Ġ1 25
vi rtual
l ong
SL VIA
GRP dy
GRP dx
29 90
SM C
Ġsurround ing
ĠRH TN
03 7
W O
Ġerror s
Ġdegree x
ĠVD D
Ġ LAY
e wxp
I RE
5 9
18 15
05 40
ĠST A
ĠSTA MP
TM OM
TMOM DMY
O VE
D WDMY
AB OVE
Ġsh own
Ġp er
Ġinclud es
Ġadd ition
Ġaddition al
typ e
Z F
OD S
4 6
IBJT DMY
09 3
ĠTO L
ĠPP i
ĠCPO S
to uch
on f
lay out
c onf
RMDMY AP
4 3
25 70
, )
Ġswitch ed
ĠPO B
ĠMP n
DM Pi
34 10
)*! ~((
ĠIs ol
igh t
V B
HIA DMY
15 30
Ġp in
Ġlow est
Ġhigh est
Ġg re
Ġgre at
Ġgreat er
ĠVT R
ĠLast TrGATE
ĠBE VEL
Ġ" -
Ġ TEXT
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
}} ]
b y
]} ,
PO ST
. :
ĠVG is
ĠVD is
ĠPOM M
ĠP S
ĠNW R
ĠM A
ĠF U
ĠFU LL
dy CB
dy CA
dx CB
dx CA
Mx s
Ġrec ommend
Ġinjector s
s quare
ex cept
P STP
E OLBLK
D CMDi
Ġw or
Ġwor k
Ġta k
Ġd y
c tor
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
li ct
conf lict
26 00
ĠHIA NMOS
ĠH VD
ĠE ither
Ġ3 50000
Ġ J
35 90
Ġst a
Ġfol lowed
y a
/ ...
/... /
ĠM J
ĠD es
ĠDes n
ĠDesn si
ĠDesnsi ty
ĠCENTER LINE
IA S
G COD
D COD
C RAM
B IAS
ĠR TMOMDMY
Ġ Q
N DEF
IF NDEF
E ven
03 2
01 60
Ġco in
Ġcoin c
Ġal way
Ġalway s
ĠS UM
I t
Con cave
Ġd ef
Ġdef a
Ġdefa ult
ĠNOT CH
ĊĠĠĠ ĊĠĠ
l ed
PO DER
100 0000
" :
Ġ[ {
Ġ 60
D ummy
02 25
ĠLay er
Ġ10 700
Ġ 300000
S SI
PC L
10 700
02 20
Ġw all
Ġf ing
ĠC o
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
c ation
SL VIAx
Ġi tem
Ġe wxp
Ġappli cation
ia s
an y
a b
CSR DMY
B ias
Ġn one
ĠMA SK
Ġ2 6
Ġ26 0000
~ ~(
an e
VIAx s
VIA xe
VIA xd
U p
11 60
)* ~~(
)) )]
Ġs im
Ġsim ult
Ġsimult ane
VT LP
RP DMY
25 00
ĠCheck ing
Ġ! ~(
Ġ! (
r ay
ar ray
ĠĠ Ċ
Ġw h
Ġ(( ((
15 20
Ġup per
Ġme th
Ġmeth od
Ġmethod ol
Ġmethodol og
Ġmethodolog y
Ġh e
Ġhe ight
ĠP ro
ĠPro tection
efin e
CPO S
9 45
35 0000
2 20
17 10
08 60
Ġsta ck
Ġstack ed
ĠMOM CAP
ĠM erged
ĠF NSTPi
ĠEDGE y
ĠEDGE x
08 5
060 5
04 20
Ġprojec tion
Ġd rain
w aive
m inimum
Ġwh ere
Ġst re
Ġstre ss
Ġre li
Ġreli ef
Ġen ab
Ġenab led
ĠEXCEPT x
ĠEW y
ĠEWy P
ĠEW x
ĠEWx P
s et
m at
mat ch
T SMC
OR I
F ine
12 8
095 5
ĠSTRAP s
ĠB JT
PO DN
AL LOD
13 5
)) .
ĠVC is
ĠS DE
ĠRec ommend
ĠO UT
Ċ ĠĠĠĠĊĠ
ig n
c o
V TEN
U ST
Mr k
I V
G D
Err y
Err x
E V
Ġexis ten
Ġexisten ce
Ġco me
ĠMed ium
S B
. }
Ġm ask
Ġ3 1
ex clude
ch annel
c ross
09 20
" )
Ġcoun t
ĠOD s
}} }
et er
PER I
DM UO
18 10
- ,
ĠI tem
ĠGMerge W
ĠGMerge B
ĠDVIAx R
ĠCon s
ĠCons ecutive
f loating
V ertical
EXP S
50 90
4 9
09 60
Ġsimultane ous
Ġsimultaneous ly
Ġs et
Ġd m
um e
r un
lay er
d m
ass ume
Ġse qu
Ġsequ ence
ĠOD DN
ĠLUP VIEDMY
ĠL eD
Ġ)) ||
pend ent
a tive
T olerance
LE D
C UP
Ġmin imun
ĠNOUSE V
ĠNOUSE M
ĠFor m
ĠFM OD
max imun
d u
S V
ME DN
ĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ġse le
ĠV ertical
ĠV B
ĠRE T
ĠN MD
ĠNMD PC
ĠM AP
ĠLAY OUT
ĠIsol ating
ĠH EL
ĠHEL P
ĠFIX ING
ĠFI LE
ĠF OR
ĠE CT
ĠD atatyp
ĠDatatyp e
ĠALL PO
ĠA SSI
ĠASSI GN
ĠASSIGN MENT
Ġ) ?
Ġ RA
ĠRA ND
ĠRAND OM
ver ed
i T
fi le
dp file
d efine
P NP
NP N
J UST
IND x
F OR
E E
05 50
ĠTh ere
ĠI n
Ġ3 6
I B
Ġs ec
Ġper im
Ġo verla
Ġm is
ĠPO n
U LV
ULV IEDMY
B IB
19 1
10 6
Ġsec ond
Ġcons er
Ġconser v
Ġconserv ative
ĠVTULN i
ĠVTUL Pi
ĠVTSN i
ĠVTS Pi
ĠVTLN i
ĠVTL Pi
8 3
049 5
Ġset up
Ġa round
ĠV SS
ĠNW is
ĠN SD
ĠD STP
ĠALL MD
Ġ UN
ĠUN ID
ĠUNID IRE
ĠUNIDIRE CT
ĠUNIDIRECT ION
ĠUNIDIRECTION AL
RW x
OD x
MOM CAP
8 9
5 40
2 100
Ġre s
Ġab ove
ĠT able
ĠC onnec
cep tion
9 100
13 9
13 4
Ġtak es
Ġla st
Ġf ound
Ġde pendent
ĠEx ception
Ġ4 00
ĊĠĠĠĠĠĠĠĠ ĠĠĠ
}} .
s hort
i c
co vered
LA X
+ )
+ (
Ġsurround ed
Ġop en
Ġin du
Ġindu ctor
ĠVB CPL
ĠV A
ĠVA CPL
ĠSR DMPi
ĠCo ndition
ĠCBD i
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
i i
V ol
Crt OD
C ore
8 25
4 68
15 3
ĠD o
vi ty
ti vity
lo at
PSD i
Last TrGATE
13 1
ĠN o
ĠM TOP
ve x
ec tion
P G
PG M
OG DMY
N POB
H VD
F DMY
D CPODE
AL OGDMY
48 5
12 20
ĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
Ġperim eter
Ġoverla pping
Ġcoinc ide
ĠNo te
ĊĠĠĠ ĊĊĠ
m A
la mp
17 0
13 90
11 7
" .
ĠSR DCMDi
ĠR atio
LUP VIEDMY
09 30
. (
Ġpro tection
Ġconnec tivity
Ġcon t
ĠPWEL is
ĠL g
ĠL O
ĠLO W
ĠDEF INE
o p
VTU LP
7 2
48 60
11 50
Ġres is
Ġresis tor
Ġof f
ĠSL VxCB
ĠC hannel
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
8 00
ĠDyCB pre
ĠDyCA pre
ĠDxCB pre
ĠDxCA pre
ĠB JTEDMY
Ġ 62
s z
r G
or bidden
T rG
S hape
RV DMY
F orbidden
ĠĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠ
Ġx s
Ġti le
ĠLUP DWDMY
ĠConnec t
in al
c ore
ai r
POM M
Ġ{{{{{ {
Ġfing er
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
W C
S VxCA
PR OJ
PA IR
O K
CBD i
8 100
26 20
05 15
Ġ{ ((
Ġun balanced
ĠNP Ui
Ġ3 60
ĊĊ ĊĊĠĠ
40 5
Ċ ĊĠĠĠ
]} ]
VER TEX
M FU
AL SE
AB UT
10 2
07 3
06 15
ĠMP is
N T
GUIDE LINE
12 80
Ġ8 3
pre V
i MPi
i MD
i ILP
EXTEN D
Ġs ch
Ġsch e
Ġsche me
Ġla r
Ġc hannel
ĠR ect
Ġ2 00
Ġ1 6
un ction
fin ed
RE G
18 70
08 7
ĠĠ ĊĠĠĠĠĠĠ
Ġvi ol
Ġun if
Ġunif or
Ġunifor m
ĠS t
ĠSt rain
ĠStrain ed
ĠP ower
Ġ ID
m ask
f loat
ex clud
exclud ing
R GN
09 6
04 3
ĠW POM
ĠVAR i
ĠF EOLBLK
CP P
ACT IVE
4 20
10 40
010 5
) ==
ĠRect angular
ĠNWR iT
21 80
05 5
in d
U X
A UX
09 10
Ġwhi ch
Ġre f
Ġref er
Ġc ross
ĠPROJ E
ĠPROJE CTING
ĠF ine
R UN
Projec ted
A SE
24 10
18 8
07 9
ĠRHTN n
Ġ5 0000
Ġ k
ur re
connec ted
b i
D OT
45 5
28 5
)) +
( !!
Ġth ree
ĠD my
t xt
ng x
hole x
c s
NW x
N TN
IN J
F LATTEN
37 90
33 70
000 16
00 022
ĠNP S
4 80
4 12
05 3
03 30
ĠĠĠĠ ĠĊĠ
ĠSH ORT
ĠNTN i
ĠCPO i
LUP WDMY
3 06
Ġun it
Ġn on
Ġlo op
Ġcon f
Ġconf ig
Ġconfig ur
Ġconfigur ation
ĠTPC DMY
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
syn c
od ed
i v
c oded
as coded
VIA u
NW RSTI
3 240
14 50
13 2
07 05
Ġviol ate
ĠT wo
ĠS P
ĠRE LAX
ĠI den
ĠBPC DMY
ĠBJT DMY
a g
3 80
2 450
16 8
10 5
ĠRMDMY AP
ĠPP S
ĠDefinition s
17 2
) }]
ĠĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠT IV
ĠP air
ĠP ITCH
ĠLOW MEDN
ĠC RI
ĠCRI TICAL
oun t
08 65
)), (
( )
Ġs up
Ġsup p
Ġin s
Ġdi ag
Ġdiag onal
T R
EXC LUDE
12 3
11 30
ĠD N
ĠCHK y
ĠCHK x
d d
S TEP
RW i
27 80
27 50
26 80
26 50
26 40
25 50
25 40
25 20
12 1
08 90
Ġm m
Ġdirec t
Ġcon vex
ĠW PO
ĠWPO UO
ĠW B
ĠRH DMY
ĠPOM UO
ĠO DMUO
ĠNW EL
ĠIO PAD
ĠGATE D
ĠD rain
ure d
bi lity
PA TH
NW STRAP
Ġy our
Ġsupp ly
Ġsele ct
Ġj u
Ġd ense
Ġal s
Ġals o
ĠV ya
ĠV y
ĠV xa
ĠPOMM B
ĠMya R
ĠM xd
ĠIden ti
ĠIdenti f
ĠIdentif y
ĠD AT
ĠDAT A
Ġ" >=
Ġ TY
ĠTY P
ĠTYP E
y y
me as
meas ured
iv ed
er ived
connec t
c ircuit
ai l
SRDMD i
N OD
DOW N
D erived
5 58
24 3
10 4
08 10
)] ].
Ġd et
Ġdet ail
Ġcon ta
Ġconta ct
C UT
Ġus ing
Ġm ed
Ġmed ium
Ġdmy PO
Ġc ate
Ġcate g
Ġcateg or
Ġcategor y
ĠW IDE
ĠSL VxCA
ĠS ection
ĠP HIA
ĠN HIA
ĠM CELL
ĠEN D
ĠCMD S
Ġ1 65
Ġ ĊĊĠĠ
pro jec
projec tion
connec tion
T IN
PW STRAP
B CWDMY
08 6
) ",
ĠĊ ĊĠĠĠ
ĠPO D
Ġ2 000
Ġ ver
Ġver te
um p
D STP
BJT DMY
B JTEDMY
ĠĊĠĠĠĠĠĠĠĠ ĠĠĠĠ
Ġ{{{{{ {{
Ġverte x
Ġme et
Ġin c
Ġg round
Ġc los
es s
VSS DMY
VDD DMY
ST ACK
Ġm any
Ġl in
Ġlin es
Ġcont in
Ġcontin u
Ġcontinu ous
ĠDM TOP
n ing
ar ning
CHK C
CHK B
CHK A
16 5
11 6
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
Ġlo c
Ġloc ated
Ġc s
Ġcs dmy
ĠF PTAP
ĠF NTAP
ĠEx c
ĠCON FIN
ĠCONFIN ED
Ġ25 6
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
li p
VA VE
V S
NO POB
N ot
EXTENT S
CSR BIB
CON VAVE
2 50
15 4
08 50
08 4
04 1
0 140
)} .
ĠĠ ĊĊĊĠ
Ġo dd
Ġcons id
Ġconsid ers
Ġbe f
Ġbef ore
s ted
M CELL
3 060
29 5
02 9
% ,
Ġpoly s
Ġju dge
Ġjudge ment
Ġdmy OD
Ġc ascoded
Ġb ump
Ġan ode
ĠM FU
ĠF lip
ĠF O
ĠB D
Ġ2 76
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
U D
TPO R
NTN i
LUP DWDMY
F ALSE
CPO i
50 4
27 5
18 20
05 20
05 05
Ġexclud ing
Ġ3 16
Ġ2 96
O C
3 15
14 40
05 2
012 5
Ġw hole
Ġs i
Ġco mp
Ġcomp ly
ĠRHTNc s
ĠLUP ULVIEDMY
ĠC hk
Ġ3 47
Ġ3 41
Ġ3 19
Ġ3 18
Ġ3 13
Ġ3 12
Ġ29 9
Ġ29 3
Ġ29 2
Ġ2 98
b al
T O
SR N
SRN K
HIA NMOS
H OC
06 70
06 10
028 5
027 36
ĠĠĠĠ Ċ
Ġex a
Ġexa mp
Ġexamp le
ĠPO S
ĠCon fined
Ġ1 50
ĊĠĠĠĠ ĊĊĠ
ĊĠĠĠĠ Ċ
CB x
35 00
02 70
0 130
Ġth ir
Ġthir d
Ġor ig
Ġorig inal
Ġd es
Ġcon ndition
Ġconndition s
ĠEC XP
ĠDMy x
Ġ3 5
Ġ 70
ĊĠĠ ĠĊĠ
xd n
m xdn
i M
PM i
N INDx
CMDi M
03 90
0 120
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġlar ger
ĠW BLK
ĠU SE
ĠSCR u
ĠSCR d
ĠR FDMY
ĠPO iSRAM
ĠPAD DMY
ĠOD iSRAM
ĠIO DMY
ĠFB S
ĠCPO iSRAM
ĠB MP
ĠB CPODE
ĠAN ALOGDMY
r d
h orizontal
S DE
GATE D
EL D
3 34
28 80
07 70
04 65
00 7
0 14
Ġ~ ~((
Ġst ated
Ġrule s
Ġmodif i
Ġmodifi ed
Ġmis match
Ġc urre
Ġcurre n
Ġcurren t
ĠW S
ĠTR UN
ĠTRUN CA
ĠTRUNCA TE
ĠRW n
ĠPM i
ĠMPC DMY
ĠC lamp
Ġ27 9
Ġ27 8
Ġ27 3
Ġ27 2
Ġ25 9
Ġ25 3
Ġ25 2
Ġ2 58
Ġ! ((
}] )
lic on
in side
h igh
S e
N STP
LLE CT
C ount
179 5
058 5
02 75
+ /
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġsi licon
Ġo c
Ġoc c
Ġ3 67
Ġ3 61
Ġ3 50
it ch
UN DEF
25 60
10 20
Ġpro ven
Ġp itch
Ġdevice s
SE M
SEM I
LUP ULVIEDMY
CHK x
15 8
11 1
Ġw an
Ġwan ts
Ġcustom er
ĠM ET
ĠMET AL
ĠFO B
bal la
SR POLY
22 1
2 76
16 10
07 8
02 3
Ġs hor
ĠW arning
ĠUBM u
ĠMetal s
ĠM ore
ĠCB u
us ing
ti c
n on
in k
d ummy
c ted
W u
VIA T
S ource
RMDMY top
ON D
OD VD
L ink
L ess
G ate
F u
B OND
28 1
07 10
00 6
Ġto ge
Ġtoge ther
Ġp ass
Ġins er
Ġdes ign
ĠVIA s
ĠIP D
ĠCMD R
sel f
ar k
POMM B
H ORIZONTAL
C heck
35 1
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġunder d
Ġunderd ri
Ġunderdri ve
Ġsmall er
Ġinser tion
Ġinc rea
Ġincrea se
Ġc lamp
ĠW A
ĠWA IV
ĠWAIV Ex
ĠTPO R
ĠL ong
ĠExc L
ĠEx cp
ĠCSR BIB
ĠCO LLECT
ĠB UT
ĠBUT T
ĠB ASE
not CMD
ark er
WPO UO
WB LK
W POM
W ON
WON P
VAR i
SR DMPi
SR DCMDi
SCR u
SCR d
S LV
RH DMY
R y
R x
R FDMY
POM UO
PO iSRAM
PAD DMY
PA node
ODc s
OD iSRAM
OD DN
O DMUO
NA node
N R
M DE
MDE X
LUP IEDMY
IF F
H x
H B
G S
DE CAPDMY
D IFF
D H
CPO iSRAM
B MP
B IG
B CPODE
AN ALOGDMY
37 60
2 24
05 9
00 024
) ||
( )]
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠ
Ġ ĊĠĠĠĠĠ
ign al
ff ective
4 425
25 6
10 70
Ġper pend
Ġperpend ic
Ġperpendic ular
ĠGATE PW
ĠGATE NW
ĠFor b
ĠForb bid
ĠForbbid en
ĠFILLER OD
Ġ ĊĊĊĠ
pre H
ot CTM
in CTM
ex c
TI V
F in
DMx s
09 75
08 45
000 1
00 3
" )),
" )))
Ġdirect ly
Ġc ri
Ġcri ter
Ġcriter ia
ĠWB DMY
ĠOD D
ĠDVIA xa
ĠC enter
ĠCenter line
Ġ3 37
Ġ3 31
Ġ1 26
Ġ1 23
ensi on
balla sted
W IRE
TPC DMY
PP N
PPN N
E nd
B P
6 6
6 00
3 40
22 00
12 50
11 10
06 90
ĠĊĠ ĊĠ
Ġsele cted
Ġpro ble
Ġproble m
Ġclos e
Ġca using
Ġc er
Ġcer t
Ġcert ain
ĠWAIVE D
ĠMetalFuse Link
ĠL E
ĠLE SS
ĠBPO V
WAIVE ABLE
D ense
AREA s
ĠĠ ĊĊ
Ġca d
e vice
T PM
PL D
M u
D evice
Check ing
5 94
2 020
16 20
10 10
Ġtak e
Ġfing ers
Ġf our
Ġfour th
Ġe a
Ġc are
ĠW ide
ĠR y
ĠR x
ĠPSD n
ĠPO BLK
ĠOD j
ĠNSTP n
ĠM in
ĠDUMMY M
Ġ3 2
Ġ )*
tic le
p ick
ing er
f inger
e ep
d efined
W IMP
TPO W
TN HB
RA N
RAN GE
R ow
CA x
C ol
A ction
17 20
10 3
) >
Ġs ignal
Ġm ax
Ġk eep
Ġcomm on
ĠWAIVE y
ĠS K
ĠSK IP
ĠRE CT
ĠMD S
ĠF unction
ĠF IN
ĠEN DPO
ĠENDPO INT
ĠEC YP
ĠC UP
ĠBE OLBLK
ĠB IG
Ġ2 50
Ġ ĊĠĠĠĠĠĠĠ
}} })
m pa
as sive
W L
T SV
SR DCMD
S quare
PR BOUNDARY
LOW MEDN
FILLER OD
CONCA V
59 40
58 50
48 00
4 140
39 60
2 16
04 75
03 1
) (
Ġcoinc id
Ġcoincid ent
ĠN a
ĠIsol ated
ĠD a
ĠA a
in ter
ar ch
VER TICAL
Se arch
SM ALL
CUP CB
A a
35 7
23 20
% ]
Ġne ar
Ġnear by
ĠT SMC
ĠCrt OD
} ]}
f t
ef er
VB CPL
VA CPL
F EOLBLK
ANGLE D
7 60
38 2
19 60
017 0
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġthe y
Ġre l
Ġrel ia
Ġrelia bility
Ġdetail s
ĠVia s
ĠRW is
ĠNSD j
ĠNET ID
ĠDM top
ĠCHB x
}} )
r al
p oly
ent ral
RW STRAP
N ON
CHK y
B ASE
11 80
ĠĠĠĠ ĊĊĊĊĠĠ
Ġt able
Ġs um
Ġpre s
Ġpres ent
Ġpossi bility
Ġoper ation
Ġno m
Ġnom inal
Ġk ind
Ġinters ection
Ġf low
Ġexample s
Ġd eg
Ġdeg r
Ġdegr ad
Ġdegrad ation
Ġcon c
Ġconc er
Ġconcer n
Ġbe h
Ġbeh ind
ĠS um
ĠR efer
ĠD IE
Ġ8 9
Ġ( +
ti al
ii i
S P
RH TN
R L
PO D
Mya R
L B
2 05
09 90
07 90
048 6
02 19
/ -
ĠĠĠ ĊĠĠ
ĠĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġstra p
Ġshor ted
Ġlar ge
Ġj unction
ĠW ARN
ĠSR DTN
ĠSL VIA
ĠOD A
ĠDMy z
ĠCon t
ĠC entral
x BVG
to tal
ce ll
T P
SIZ ING
PRE CHK
P cs
OD A
N cs
MPi M
DRC GRID
ĠĠĠĠ ĊĠĠĠĠ
Ġrecogn ition
Ġg ood
Ġe ffective
ĠCENTER S
ĠB P
} ]},
es ide
U L
S ide
S hort
M AR
MAR K
ESD LU
6 9
37 8
29 6
ĠĠĠĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
Ġpo ten
Ġpoten tial
Ġnet s
ĠP assive
ĠP PR
ĠO VL
ĠL D
ĠF ALSE
ĠEXC PT
ĠEXCPT ION
ĠERR DPO
ĠCon vex
ĠCPO R
ĠALLMD notCMD
Ġ5 00
Ġ 300
Ċ ĊĠĠĊĠ
n TrG
le ss
b eside
Y S
X S
W H
VG D
UR T
UBM i
SR GATE
SH O
SHO URT
OD Y
OD VC
OD PO
Is o
H int
FI ELD
EXT rGATE
DVx s
DVIA n
CO R
C OPY
B ODY
B GA
6 15
25 7
08 8
08 30
05 10
0205 2
016 5
/ (
Ġdi m
Ġdim ension
Ġ[! (
ĊĠĠĠĠ ĊĠĠĠ
}]} )
st age
s li
sli ce
SL VxCA
C U
005 5
Ġw ould
Ġth ere
Ġpro p
Ġm er
Ġmer ge
Ġc lu
Ġclu st
Ġclust er
ĠT SV
ĠFB x
ĠF LO
Ġ3 40
Ġ 11
d er
W o
W SE
W E
SA ME
RE LAX
PO A
G AB
DUMMY M
B GAB
28 6
2 02
11 8
00 60
00 306
Ġw ell
Ġti m
Ġtim es
Ġocc urre
Ġoccurre d
Ġb it
ĠNO H
ĠNOH I
ĠNOHI ER
ĠCTMW R
tern al
W idth
Q H
E qual
66 10
38 5
3 35
26 9
11 70
04 80
004 16
00 65
ĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠ
Ġ~~(( (
Ġto o
Ġsum mation
Ġst age
Ġs hi
Ġshi ft
Ġor der
Ġca thode
Ġapp ly
Ġ[! ~(
ĠWS y
ĠWS x
ĠW BM
ĠT riangle
ĠRegion s
ĠPSDc s
ĠPO A
ĠNSTP is
ĠN umber
ĠMn V
ĠIn side
ĠDmy PO
ĠDmy M
ĠDNW n
ĠC ol
ĠCol le
ĠColle ctor
ĠBE SIDE
ĠB ase
Ġ!(( (
Ġ }
Ġ _
ult ra
s ig
sig m
sigm a
rd b
o tal
c olor
V OL
TR IGGER
TI LE
T otal
SE LECT
S AN
SAN I
SANI TY
R iT
Q V
Pin s
NW RiT
M OD
L S
L D
I MD
GO O
G P
F PSTPi
Con fined
CUP VIAT
CPO EX
89 9
19 6
090 5
057 5
034 2
015 5
)+ ~(
" ))]
ĠVIA u
ĠP ER
Ġ type
Ġ im
ĊĠ ĊĠĠ
i ent
M aximum
8 28
38 8
27 00
13 20
08 1
06 30
Ġocc ur
Ġins u
Ġinsu ff
Ġinsuff ic
Ġinsuffic ient
Ġcont ain
Ġcan not
ĠDUM VIA
Ġ ter
Ġter mi
Ġtermi an
Ġtermian l
m arker
H ig
DUM VIA
15 60
09 70
)] ]
ĠĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġcenter ed
ĠPOLY c
ĠPO L
ĠPA SSI
ĠPASSI VE
ĠN e
ĠNe xt
ĠI MP
ĠFunction al
ĠFIN x
ĠFINx x
ĠFI ELD
Ġ4 4
Ġ25 5
Ġ1 500
rec tion
] }}
V I
VI CE
T urn
NW EL
FLO T
DE VICE
B EOLBLK
7 1
57 00
30 90
3 90
23 2
13 10
07 80
07 7
ĠĠĠĠ ĊĊ
Ġse pa
Ġsepa r
Ġsepar ated
Ġm arker
Ġd ata
Ġdata b
Ġdatab ase
ĠWB VIA
ĠPW GATE
ĠNW GATE
ĠMPi M
ĠIn FO
ĠB U
ĠBU LK
ĊĊ ĠĠĠĠĠ
o P
SRE SD
S N
PW GATE
POLY G
POLYG ON
P oP
NW GATE
N M
GATE PW
GATE NW
Crt CMD
B L
69 80
45 80
33 7
14 20
09 8
07 30
06 65
008 5
Ġspec if
Ġspecif ic
Ġin ternal
ĠP attern
ĠCo mpa
ĠCompa ct
Ġ6 6
Ġ ĊĠĠĠĠĠĠĠĠĠ
Ġ 64
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
inter act
W ith
W D
NOD AL
36 8
18 2
17 00
09 80
00 368
00 168
00 15
)* ~(
ĠĠĠĠĠ ĊĠĠ
ĠĠ ĊĊĠĠ
Ġ{{ (
Ġu lt
Ġult ra
Ġst air
Ġs ha
Ġsha re
Ġpro j
Ġproj ect
Ġim p
Ġbit cell
Ġ[ >=
ĠV TEN
ĠTPO W
ĠRe ticle
ĠR O
ĠRO DMY
ĠP U
ĠPU SH
ĠO ther
ĠF NOD
ĠF ACTOR
ĠE MOD
ĠCUP VIAT
ĠC y
ĠC ount
ĠA nd
s eg
rid ge
b e
Group B
Group A
FB E
C x
9 2
35 10
13 60
05 45
05 25
040 5
Ġs ol
Ġsol id
ĠRE S
ĠDMx s
ĠCUP CB
Ġ6 00
Ġ36 45
Ġ2 75
Ġ1 296
Ġ .
g ger
RA s
N a
MPC DMY
D a
10 60
Ġs hape
Ġinc re
Ġco mpa
Ġcompa ring
Ġad ju
Ġadju sted
ĠS ource
ĠPODE W
ĠPER IM
ĠPERIM ETER
ĠO UTER
ĠLOW ER
ĠG T
ĠDNW is
ĠB ridge
ĠB PM
Ġ300 00
Ġ3 30
ĊĠĠ Ċ
ot tom
g roup
b ut
VIAy R
RO DMY
REA L
NSD j
FO B
BPC DMY
14 6
14 4
0 13
% }
ĠĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĊĠ ĊĠ
Ġta p
Ġsta gger
Ġstagger ed
Ġpar a
Ġpara m
Ġparam eter
Ġopen ing
Ġfin s
Ġd ec
Ġdec ide
Ġac tive
ĠVT N
ĠNW S
ĠL MARK
ĠD istance
VT i
T i
SL s
R T
P oly
LOBAL NET
G LOBALNET
38 4
22 8
2 90
15 35
14 2
13 70
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĊĠ
ĠĊĠĠĠĠ ĊĠĠĠ
ĠĊ ĠĠĠĠĊĠ
Ġtap e
Ġsimultane ou
Ġsimultaneou se
Ġsimultaneouse ly
Ġshor ter
Ġincre ments
Ġha nd
Ġhand l
Ġhandl ing
Ġgroup s
Ġd efine
Ġas s
Ġass ign
Ġa ct
Ġact ually
ĠSRDOD x
ĠSR PO
ĠR OUND
ĠPP EN
ĠPO EX
ĠPA SS
ĠNW OD
ĠN on
ĠNon F
ĠNonF unction
ĠMP dpfile
ĠMP S
ĠMD notCMD
ĠMD dpfile
ĠMA Y
ĠM PR
ĠL B
ĠLB R
ĠH OR
ĠH IGH
ĠG LOB
ĠFLO AT
ĠFLOAT ING
ĠExc W
ĠEXT rGATE
ĠDi rection
ĠDE V
ĠChk W
ĠChk L
ĠCPO dpfile
ĠCPO O
ĠCPO EX
ĠCPO DN
ĠCMD dpfile
ĠB SH
ĠB CB
ĠB CA
ĠA CB
ĠA CA
Ġ3 10
Ġ18 18
Ġ18 15
Ġ18 12
Ġ15 15
Ġ15 12
Ġ TH
ĠTH IN
j og
g rid
co ndition
_ ]
[ -
[- =
W S
TIE y
TI Ex
Se al
SR PO
SR DMP
S tepping
RH TNB
R TMOMDMY
POLY c
P D
PD G
O F
OF FGRID
NE CT
MD W
L MARK
IM EXCL
I S
F loat
EX GS
EX G
EDGE y
EDGE x
Con B
CON NECT
ALL PO
ALL MD
A but
57 80
5 70
45 1
40 10
34 2
3 07
2 62
2 45
19 50
19 5
18 80
110 5
054 72
025 65
014 9
)+! ~((
)+! ((
))* (
) <=
ĠĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĊĠĠĠĠĠĠĠĠ ĊĠ
Ġw arning
Ġvi rtual
Ġca se
Ġc ou
Ġcou p
Ġcoup led
ĠW ire
ĠV i
ĠNWRiT n
ĠNSD u
ĠF rom
ĠF TPM
ĠDM IMEXCL
ĠD elta
Ġ5 3
Ġ3 8
Ġ3 57
Ġ3 51
Ġ2 90
Ġ2 25
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
or t
ar a
ara ctor
VB i
SE L
S z
F ig
DV i
D W
D S
D DTN
B ond
B i
B PM
8 51
56 20
5 500
3 31
21 60
16 30
13 80
10 7
10 30
09 2
08 80
045 5
019 5
ĠĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĊĠ Ċ
ĠĊĠ Ċ
Ġwidth s
Ġum in
Ġturn ed
Ġti g
Ġtig h
Ġtigh ten
Ġs hapes
Ġre la
Ġrela ted
Ġpossi be
Ġp a
Ġpa ckage
Ġo x
Ġox ide
Ġg en
Ġgen er
Ġgener ation
Ġend ca
Ġendca p
Ġen vi
Ġenvi r
Ġenvir on
Ġenviron ment
Ġdirect r
Ġdirectr ion
Ġclos ed
Ġb ottom
ĠST P
ĠS V
ĠPSTP n
ĠO DB
ĠODB LK
ĠNSD n
ĠMPC i
ĠMIN IP
ĠM is
ĠMis match
ĠL o
ĠLo op
ĠIn ter
ĠInter act
ĠG O
ĠGO O
ĠFLO OR
ĠF POD
ĠEN MOS
ĠE m
ĠEm it
ĠEmit ter
ĠE ffective
ĠE PMOS
ĠDmy VIA
ĠDmy OD
ĠDRC GRID
ĠD im
ĠDim ension
ĠCM O
ĠC x
ĠC ritical
ĠC NT
Ġ8 600
Ġ65 00
Ġ3 15
Ġ29 5
Ġ165 00
Ġ14 40
Ġ14 4
Ġ11 000
Ġ1 3000
Ġ1 2000
Ġ( >
Ġ( <
Ġ 61
} *
u ad
ring s
ran t
pro p
o VIA
n oVIA
in cell
im ary
g L
g H
el d
edge M
e ticle
c onn
c ascoded
Z one
RA L
R eticle
Q uad
P AR
PAR T
NW EN
N IND
Metal Fuse
M S
LOW ER
LE F
LEF T
H W
GLOBALNET I
G F
ENT RAL
E SIDE
D ONUT
C y
C athode
C ENTRAL
B SH
B ESIDE
A MS
9 3
8 6
7 50
7 140
6 25
5 62
5 180
3 16
23 5
2 170
180 5
15 500
13 8
07 50
05 35
017 4
)). (
))* ((
) },
% ~
Ġle ad
Ġfor bid
ĠTPC i
Ġ7 00
f ree
R B
PR D
PRD L
M M
F TPM
A PRDL
29 60
048 5
004 63
00 24
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
Ġviol ated
Ġseg ment
Ġs c
Ġpro hi
Ġprohi bi
Ġprohibi ted
Ġimp ort
Ġimport ant
Ġal ign
Ġ[ +
Ġ[+ =
ĠVIA T
ĠVG dpfile
ĠVD dpfile
ĠN PODE
ĠL og
ĠLog ic
ĠERR c
ĠERR C
ĠD ifferent
ĠBPC i
Ġ6 25
Ġ16 6
ĊĠĠ ĊĠĠ
|> <|
g round
an ner
VIAyy R
V IO
VIO LAT
VIOLAT ION
SI MP
SIMP L
SIMPL IF
SIMPLIF Y
SD s
RP L
RE CT
RAP H
G RAPH
Ex pand
D ensity
8 2
3 25
14 70
14 1
03 078
02 15
) })
ĠĠĠĠĊĊ ĊĊĊĠĠ
ĠĠ ĊĠĠĠĠĠ
Ġw ide
Ġp r
Ġpr imary
Ġno si
Ġnosi e
Ġcont r
ĠV X
ĠVX Merged
ĠP oly
ĠNW EN
ĠM T
ĠL ON
ĠLON G
ĠE ver
ĠEver y
ĠBPM Ti
ĠBP VTi
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ra p
rap h
k age
ab ut
9 5
22 50
2 146
18 1
116 6
Ġw as
Ġth ro
Ġthro ug
Ġthroug h
Ġres ult
Ġprop e
Ġpro du
Ġpotential s
Ġoverla pp
Ġoverlapp ed
Ġnot ch
Ġen able
Ġe ute
Ġeute c
Ġeutec tic
Ġcover s
Ġcontr ary
Ġc ould
Ġb as
Ġbas ed
Ġalign ment
ĠVi ol
ĠViol ating
ĠV I
ĠSR DMP
ĠPoly im
ĠPolyim ide
ĠPSTP j
ĠPSTP is
ĠPERIMETER Y
ĠPERIMETER X
ĠP STRAP
ĠP NP
ĠNWRiT s
ĠNSDc s
ĠNP N
ĠM UST
ĠM ID
ĠL T
ĠDVIAx s
ĠCrt M
ĠC hap
ĠChap ter
Ġ te
Ġte st
}] ,
} .
th ick
thick n
thickn ess
de pendent
W IDE
V DMY
ST A
STA G
STAG GER
S ta
R IGHT
PSTP j
PODE W
M TOP
LB R
L ength
Ex panding
CR VDMY
96 00
34 45
34 35
27 55
26 6
24 40
2 765
2 65
2 18
09 25
09 15
06 9
06 25
014 6
0 145
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĊĠ
ĠĠĠĠĠĠĠĠ ĊĠĠ
ĠĠĠĠ ĊĊĊĠ
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĊĠĠ ĊĠĠ
Ġ{{{{{{{ {
Ġw on
Ġw ant
Ġviolation s
Ġun i
Ġtape out
Ġstr ong
Ġstrong ly
Ġse e
Ġs u
Ġsu b
Ġre m
Ġrem ind
Ġremind er
Ġr ight
Ġp osi
Ġposi tion
Ġover w
Ġoverw ri
Ġoverwri ted
Ġon es
Ġo ct
Ġoct angle
Ġm ight
Ġm es
Ġmes h
Ġk n
Ġkn ow
Ġknow s
Ġju st
Ġis n
Ġin dependent
Ġin d
Ġind iv
Ġindiv id
Ġindivid ual
Ġgate d
Ġg lo
Ġglo bal
Ġform s
Ġfin d
Ġf al
Ġfal se
Ġdes ig
Ġdesig ner
Ġcross ed
Ġconservative ly
Ġco mb
Ġcomb in
Ġcombin ed
Ġclos est
Ġc y
Ġcy c
Ġcyc lic
Ġbut ted
Ġb u
Ġbu l
Ġbul k
Ġb ound
Ġbound ing
Ġb o
Ġbo x
Ġb ec
Ġbec a
Ġbeca use
Ġa u
Ġau tom
Ġautom a
Ġautoma tical
Ġautomatical ly
Ġa part
Ġ[ <
ĠY ou
ĠW ith
ĠWith in
ĠV aractor
ĠV CE
ĠT DVi
ĠSR CSR
ĠSE AL
ĠSEAL E
ĠSEALE ING
ĠS hape
ĠS M
ĠSM ALL
ĠRECTANGLE S
ĠPSD u
ĠPER P
ĠPERP END
ĠPERPEND IC
ĠPERPENDIC ULAR
ĠP re
ĠNW s
ĠH BL
ĠH BC
ĠFB E
ĠESD LU
ĠC ell
ĠC P
ĠCP S
ĠBSH BL
ĠBSH BC
ĠBPM Bi
ĠBP VBi
ĠB TSV
ĠB TPM
ĠB MD
Ġ= ((
Ġ9 00
Ġ8 7
Ġ8 60
Ġ600 000
Ġ5 5
Ġ2 8
Ġ+ /-
Ġ qu
ĊĊ ĠĠĠĠ
ĊĊ ĊĊĊĠĠ
ter connection
sp ect
side s
s ect
rec is
recis ion
re es
p recision
p oint
op s
n terconnection
lo ops
lic ts
inter sect
i rection
ex panding
eg rees
d irection
d egrees
conf licts
a p
With out
U SA
USA GE
TN s
T ACT
Sta ir
Seal ring
SRDOD x
SRAM n
PO L
PO EX
P oint
P assive
MP S
K A
INTE TACT
INT SIDE
I nterconnection
FM OD
FB x
E Z
DV u
DM u
DM IM
CPO DN
CK ECK
A ssembly
98 5
96 80
84 40
8 5
7 300
66 40
65 00
64 6
64 20
61 60
6 20
59 3
56 70
5 985
5 50
5 210
42 80
40 1
4 29
38 80
38 6
36 6
34 8
34 20
3 120
3 08
29 65
28 60
28 35
26 8
24 70
24 60
22 6
20 90
20 60
2 300
19 80
18 60
18 30
17 6
17 40
15 1
14 60
13 7
12 87
11 35
108 5
08 15
07 35
06 7
05 55
05 1
04 2
02 51
012 9
006 9
005 1
004 4
00 646
00 35
00 176
00 123
00 073
)}] )
)] }
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĊĠĠ
ĠĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĊĊĠĠ
ĠĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠ ĊĠĠĠĠĊĠĠĠ
ĠĊĠĠ ĊĊĠ
Ġw ai
Ġwai v
Ġwaiv ed
Ġv aractor
Ġuti l
Ġutil ized
Ġus es
Ġunder o
Ġundero ver
ĠunB AL
Ġth ick
Ġt oler
Ġtoler ant
Ġstrap s
Ġsc ri
Ġscri be
Ġs n
Ġsn ap
Ġsnap b
Ġsnapb a
Ġsnapba ck
Ġrecogn ize
Ġre ticle
Ġqu ad
Ġquad rant
Ġout ter
Ġn fin
Ġm ess
Ġmess age
Ġm V
Ġle a
Ġlea kage
Ġinter a
Ġintera cted
Ġflag ged
Ġfi eld
Ġf ur
Ġfur ther
Ġdefinition s
Ġcell s
Ġc al
Ġcal c
Ġcalc ula
Ġcalcula ted
Ġby pa
Ġbypa ss
Ġbypass ed
Ġb et
Ġbet ter
Ġb ad
ĠV th
ĠV g
ĠVg s
ĠU ti
ĠUti l
ĠUtil iz
ĠUtiliz ation
ĠT P
ĠSL VIAx
ĠSH DMIM
ĠR I
ĠRI SK
ĠOther w
ĠOtherw ise
ĠO u
ĠOu ter
ĠNW RST
ĠNWRST IR
ĠMPC FINAL
ĠM ask
ĠIn ternal
ĠIn ner
ĠIden tical
ĠFM IN
ĠF ind
ĠF i
ĠFi eld
ĠConnec tion
ĠCo vered
ĠCPODE W
ĠC oun
ĠCoun ts
ĠC ore
ĠC PMOS
ĠC DM
ĠB ut
ĠAP s
ĠAP n
ĠAN R
ĠA u
ĠAu x
ĠAux i
ĠAuxi li
ĠAuxili ary
ĠA s
Ġ@ (
Ġ8 8
Ġ7 7
Ġ7 20
Ġ7 2
Ġ5 40
Ġ5 1
Ġ4 90
Ġ4 20
Ġ3 14
Ġ20 1
Ġ2 88
Ġ2 62
Ġ2 4
Ġ2 37
Ġ2 200
Ġ2 11
Ġ1 6000
Ġ1 200
Ġ1 20
Ġ(((( (
Ġ( <=
Ġ rep
Ġrep la
Ġrepla ce
Ġreplace ment
Ġ ;
ĊĠ Ċ
Ċ ĊĠĠĠĊĠĠ
urround ing
u lti
ulti ple
t mp
s urrounding
s ure
s ignal
s c
sc anner
m ultiple
m ost
lo ck
inter connection
g t
g m
ce ss
balla ted
b lock
Y our
WB DMY
WA VE
W ALL
VD S
VAR OD
V CE
TER CA
TERCA T
T DVi
S Q
SQ L
Quad rant
Quad ant
NP S
MetalFuse Link
MD S
LO T
IN TERCAT
HB L
H BC
FM IN
FM AX
E MOD
DN S
D raw
D STRAP
CP S
CP MOS
CO LLECT
C NT
BSH BL
BSH BC
BPO V
BPM Ti
BPM Bi
BP VTi
BP VBi
B TSV
B TPM
B MD
A rray
A A
98 20
87 9
8 70
68 60
6 700
5 14
5 020
38 20
35 20
32 20
3 38
3 21
3 09
3 080
29 20
28 10
27 70
22 20
20 9
18 7
15 80
14 7
11 90
00 255
( ))
% .
ĠĠĊ ĊĠĠĠ
Ġwh e
Ġwhe el
Ġsi te
Ġs te
Ġste p
Ġring s
Ġpro cess
Ġim m
Ġimm un
Ġimmun i
Ġimmuni ty
Ġi ter
Ġiter ative
Ġiterative ly
Ġg raph
Ġg m
ĠW n
ĠW IRE
ĠVi olation
ĠTR IA
ĠTRIA N
ĠTRIAN GLE
ĠS i
ĠO dd
ĠM DV
ĠLoop s
ĠC ross
ĠCross ed
Ġ9 9
Ġ( {{
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĊĠ ĊĊĠ
ĊĊ ĊĠĠĠĠĠ
r ight
p o
le ft
ex tension
] }}]
VT N
TI ER
T RI
9 36
9 300
8 250
8 24
76 00
75 70
69 20
378 5
37 2
3 04
29 30
19 10
14 80
14 10
068 5
06 75
06 55
008 2
0040 8
00 272
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĊĊĠ ĊĠ
ĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠĠ
Ġsc anner
Ġre t
Ġret angle
Ġre al
Ġr ad
Ġproper t
Ġprodu ction
Ġprodu c
Ġproduc tivity
Ġmax im
Ġmaxim ize
Ġm ass
Ġle ft
Ġl ith
Ġlith og
Ġlithog raph
Ġlithograph y
Ġl im
Ġlim i
Ġlimi ted
Ġimp li
Ġimpli es
Ġimp l
Ġimpl ant
Ġimplant ation
Ġhigh ly
Ġground ed
Ġen sure
Ġe vent
Ġde pend
Ġdepend s
Ġd u
Ġdu ring
Ġcon fined
ĠWB AP
ĠVx M
ĠVxM e
ĠV dd
ĠTPC FINAL
ĠT AP
ĠSQUA RES
ĠSE G
ĠSEG MENT
ĠS y
ĠS x
ĠS LOT
ĠMIM EXCL
ĠL ow
ĠIN FO
ĠF inal
ĠEx pand
ĠExpand s
ĠE r
ĠConnec ted
ĠBPC FINAL
ĠB ump
ĠAP V
ĠA spect
Ġ4 7
Ġ3 3000
Ġ2 6000
ĊĠĠ ĊĊĊĠ
ĊĊ ĊĊĠĠĠĠĠ
vi e
pro ven
n closure
ground ed
center line
b ottom
ad jacent
a vie
` }
]} )
]] ,
] ]}
W avie
TP CRVDMY
SR DMY
SH IF
SHIF T
S y
S x
RT LB
PO S
NOT A
NC PO
MP CRVDMY
LOB A
INF O
G LOBA
EF P
E nclosure
AN NOTA
AD D
9 84
75 9
7 240
69 30
67 7
64 00
63 70
6 759
6 677
58 40
34 40
33 28
318 5
3 76
299 5
24 80
18 40
16 6
16 1
05 65
0410 4
037 2
009 5
0024 4
000 9
ĠĠĠĠ ĊĊĊĠĠ
Ġ{{{{{{{ {{
Ġ{(( (
Ġz ig
Ġzig z
Ġzigz ag
Ġsupp ort
Ġsecond ary
Ġrad ial
Ġr r
Ġpro t
Ġprot r
Ġprotr u
Ġprotru sion
Ġpar tial
Ġpartial ly
Ġp ur
Ġpur po
Ġpurpo se
Ġp l
Ġp imary
Ġop tions
Ġo b
Ġob t
Ġobt use
Ġfu n
Ġfun ction
Ġa spect
ĠVIAyy R
ĠVIAy R
ĠRect angle
ĠO N
ĠG N
ĠF L
ĠFL IP
ĠEx ten
ĠExten ts
ĠE D
ĠC ascoded
ĠB ER
ĠAc ute
ĠAA IO
ĠA SP
ĠASP ECT
Ġ9 90
Ġ8 400
Ġ75 00
Ġ7 80
Ġ45 00
Ġ4 900
Ġ4 40
Ġ3 400
Ġ3 24
Ġ3 200
Ġ2 1
Ġ18 20
Ġ15 60
Ġ14 70
Ġ10 10
Ġ1 40
Ġ1 30
Ġ1 210
Ġ1 10
Ġ- (
Ġ ro
Ġro ut
Ġrout ing
s ome
pac kage
n in
nin th
lo g
log ic
g ood
edge AP
Vx Mer
VxMer g
V AL
VAL U
VALU E
TPC FINAL
TO UCH
SR DCPO
PO W
MPC FINAL
G o
D IE
7 3
7 131
7 12
712 5
5 23
5 21
45 08
36 1
17 5
13 27
00 37
00 28
00 135
)) ))
(( (
ĠĠĠĠ ĊĊĠĠĠ
ĠĠĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
Ġst ate
Ġs lo
Ġslo p
Ġpl s
Ġp ut
Ġincre ment
Ġfi lter
Ġfilter s
Ġf lip
Ġf an
Ġfan out
Ġexclu sion
Ġex po
Ġexpo sure
Ġc ircu
Ġcircu i
Ġcircui ts
Ġc entral
Ġb all
Ġal low
Ġac c
Ġacc or
Ġaccor d
Ġaccord ing
ĠVIAs x
ĠT ri
ĠPP U
ĠP ssi
ĠPssi ve
ĠP ad
ĠOVER L
ĠNACT i
ĠN STRAP
ĠIN SD
ĠINSD IE
ĠGLOBAL NET
ĠGLOBALNET I
ĠGLOBAL NE
ĠGLOB A
ĠG LO
ĠG L
ĠEC Y
ĠEC X
ĠDVIA n
ĠDM u
ĠCo Wo
ĠCoWo s
ĠCON T
ĠCM OS
ĠB or
ĠBor der
ĠA l
ĠA but
Ġ2 04
Ġ( -
Ġ round
Ġ `
Ġ REAL
Ġ 660
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĊĠĠĠĠ ĊĠĠ
ĊĠĠ ĊĊĊĊĠ
ĊĊĠ ĊĊĊĠ
ĊĊĠ ĊĊĊ
ĊĊĠ ĊĊ
ĊĊ ĊĠĠĠ
} >=
x CHK
ti ty
ti er
r atio
o verlap
inter connect
check ed
an tity
]] )
WB VIA
VT R
VTR IG
V o
ST OR
SI STOR
S LOT
RE SISTOR
R efer
PP S
POLY IM
POLYIM IDE
P H
PH AN
PHAN TOM
NSD u
N PODE
M T
BPC FINAL
B ridge
AA IO
96 9
75 2
7 150
68 20
62 70
6 300
57 50
54 00
33 90
313 5
20 6
2 130
2 13
17 80
11 25
09 35
07 75
05 13
02 35
000 89
00 25
00 192
, ]