#version: 0.2
Ġ M
Ċ Ġ
I N
Ġ A
V I
VI A
R E
Ġ =
Ġ <
Ġ O
T E
Ġ S
Ġ Ġ
Ġ (
e n
Ġ E
Ġ IN
Ġ a
Ġ N
i n
Ġ >
t e
o f
Ġ VIA
Ġ C
Ġ t
r e
RE A
R A
I O
u m
Ġ {
S I
O T
U T
o n
C T
en d
D M
ĠN OT
Ġ B
C H
te x
Ġ @
A REA
Ġ 0
tex t
| >
of text
end oftext
< |
P O
IN G
9 0
Ġ um
a l
N D
Ġt o
L E
ĠIN TE
Ġ [
ĠA B
D E
ĠAB UT
Ġ 90
t h
G E
Ġ m
RE G
e t
D N
e r
i d
RA CT
ĠINTE RACT
IO N
REG ION
D GE
e d
L A
Ġ> =
Ġ P
S R
e c
Ġ s
N G
SI DE
Ġa n
T H
Ġ c
E R
l e
ĠE X
ĠA ND
Ġ ĊĠ
DM Y
l o
Ġ REGION
et al
in g
t i
a n
p a
Ġ in
ĠĠ ĠĠ
Ġ W
Ġ of
i s
Ġ D
Ġ b
c e
CH K
Ġm etal
Ġan d
o r
ĊĠ Ġ
ĠE DGE
Ġ G
R S
Ġ w
E N
Ġ T
ĠEX T
1 0
L Y
Ġ ^
E X
ĠC O
NG LE
Ġ R
ĠO R
U LA
I D
Ġ L
Ġ n
Ġ= =
Ġ l
ĠB Y
Ġ X
pa ce
Ġ 1
ĠO D
A L
ĠS R
p e
ĠIN SIDE
Ġ d
ĠO N
ĠON LY
C D
ĠO P
c h
R ING
PO SI
ĠOP POSI
ĠOPPOSI TE
A TE
I P
Ġ f
ĠC SR
Ġ< =
Ġa re
ĠS ING
ULA R
ĠSING ULAR
id e
! !
r an
B RS
ran ch
R ID
h e
) *
ĠA REA
o t
O D
E T
) ]
E C
O M
Ġ is
Ġn ot
Ġ 2
id th
s t
Ġ re
ti on
y pe
Ġ DM
l a
1 1
IN D
Ġt he
Ġ V
r o
C A
v e
ĠA NGLE
ec t
4 5
Ġare a
lo w
ĠC H
E DGE
Ġs pace
ype BRS
a t
on n
H V
0 0
ĠIN T
i th
l low
t y
CD DMY
C C
T IO
RA TIO
ĠA CC
ĠM x
Ġ RATIO
UT SIDE
ĠO UTSIDE
N C
D B
ĠE NC
Ġ I
I TH
D IO
ĠB ranch
Ġm u
1 2
ĠN ET
T Y
EC K
i on
LA Y
LAY ER
llow ed
i a
Ġ e
Ġa llowed
S D
ĠW ITH
Ġ or
O S
T ypeBRS
ĠCH IP
ti ve
Ġto p
g e
p re
Ġc onn
ĠP A
g ion
Ġ on
G ATE
U M
Ġ PO
Ġ LAYER
Ġ r
Ġw idth
s i
Ġmu st
O W
Ġ RE
Ġb e
en g
eng th
te r
CH ECK
G RID
NG TH
LE NGTH
o p
ĠT CDDMY
) /
Ġ *
E AL
EAL RING
A NGLE
ro m
A R
C B
S O
u la
lo at
ĠIN D
Ġl ength
loat ing
Ġw ith
CT ANGLE
i g
O N
ec k
ĠRE CTANGLE
Ġ LENGTH
Ġc h
) +
P A
CA P
ĠO F
in e
O G
I Z
ĠM OM
ĠS IZ
ĠS D
e f
er r
O P
ĠA L
Ġb y
U P
ĠG ATE
Ġ p
Ġ( (
Ġl ine
u re
Ġ 45
C SR
Ġs e
S T
Ġr u
E ND
en si
t op
ensi ty
ĠG RID
um ula
umula tive
o l
C O
E CT
ĠS pace
e s
ĠINTE RS
ĠINTERS ECT
ĠINTERSECT ING
g le
ĠS EALRING
L OS
Ġre gion
H O
F M
M OM
HO LE
ĠC B
) )
ĠP R
T CD
V ia
O U
c lo
clo s
ed ge
Ġconn ect
DE N
CH IP
Ġ !!
O v
Ġd o
s ide
p M
Ov pM
ĠENC LOS
ĠI SO
ĠCO N
Ġdo es
ĠR DB
L LE
N P
ĠPA RA
ĠPARA LLE
ĠPARALLE L
clos ure
N ER
ĠVIA x
in i
M E
h a
le a
ĠAL L
a y
2 3
o w
ĠDM V
i l
RA M
r ing
Ġ g
ig h
U RE
ĊĠ ĠĠĠĠ
Ġ pa
Ġ 3
M x
Ġ 4
V ER
Ġon e
2 5
AL L
Ġ[ !!
d e
EX C
ol t
Ġse al
D V
V olt
u p
l y
o u
PA ND
ĠENCLOS E
w i
V T
Ġch eck
v er
) -
a r
ĠCO IN
R I
1 8
ĠCO P
ĠS TE
ĠSTE P
ID TH
en t
ha pe
ĠCOP Y
Ċ Ċ
1 3
ĠACC UM
ĠACCUM ULA
ĠACCUMULA TE
d n
Ġ F
Ġ -
ĠT OU
ĠTOU CH
B ranch
CA CB
D TCD
ĊĠ ĠĠ
0 5
ini tion
ef inition
f il
pre fil
prefil ter
E A
OW ME
OWME DN
ĠW IDTH
Ġf rom
Ġ Y
Ġ en
ĠV T
Ġ lea
ĠCSR DMY
U L
Ġlea st
r id
re p
Ġ HV
M er
Ġf or
Ġ DEN
Ġin side
Ġ ]
up OvpM
upOvpM dn
Ġc umulative
DN W
ĠM EA
ĠMEA S
ĠMEAS URE
N OT
Ċ ĊĠĠ
Ġa t
m um
n er
a te
f f
le l
al lel
SI TY
D PO
Ġ !
ĠDEN SITY
r allel
)* (
Ġf loating
Ġru n
Ġ 5
is k
R R
ĠR isk
f rom
F loating
W IN
n et
ĠSIZ ING
g re
h is
Ġan gle
gre e
ĠD efinition
o m
TE D
N EC
NEC TED
ec tion
Ġl ay
ĠĠ ĠĊĠ
hape s
ĠS hapes
Ġp ro
Ġlay er
ĠOR TH
ĠORTH OG
ĠORTHOG ON
ĠORTHOGON AL
ĠCON NECTED
Ġs ide
ing le
ĠS RAM
w e
Ġb et
Ġbet we
Ġbetwe en
w o
EX D
A P
ĠM top
l u
M P
ĠW idth
g ed
c lu
Ċ ĊĠ
EX T
ĠE n
O OD
R T
s e
d ensity
B M
~ (
i p
) )]
OP ER
OPER TY
)* !
ĠSIZ E
VI RT
Ġ "
1 7
Ġconn ection
Ġ h
om m
c t
IN T
A C
ĠD UM
TE R
S ingle
ĠĠ Ġ
Single Via
omm end
Mer ged
L DB
Ġ err
Ġd e
IN E
a x
ĠD FM
ĠPA D
1 4
ĠEn closure
ax i
ĠW IND
ĠWIND OW
o le
ĠB DTCD
e gion
m e
c ed
1 5
Ġpa rallel
axi mum
ĠG OOD
Ġ edge
Ġ U
T CDDMY
0 9
r i
M OS
Ġru le
ĠĠ ĊĠ
ĠC h
Ġe ff
g on
SI Z
MP TY
Ġd i
B AR
Ġch ip
Ġre s
SIZ E
Ġd ensity
in d
x Merged
ĠM etal
ĠEX C
T R
VT L
Ġeff ect
Ġe x
00 1
ĠPR OPERTY
V E
Ġ +
AC K
ĠN W
ind ow
ĠĠĠĠ ĊĠ
Ġb ar
ĠL OWMEDN
ĠB ACK
ĠBACK UP
00 0
c tion
a s
p p
Ġ u
or ner
Ġc orner
R NER
an gle
Ġ{ {
p ec
ĠEX PAND
F DM
ĠPR INT
m p
S E
ec ommend
clu de
N W
al l
Ġ[ !
N ET
ĠBranch SingleVia
as Via
H asVia
Ġh ole
Ġ v
I VE
H igh
ĠA P
L ow
Ġen closure
ĠM y
OG O
)+ !
ĠT his
mp ty
Ġ! =
2 0
Ġde gree
ce p
c umulative
ĠĠĠĠ ĠĠĠĠ
Ġ o
C UP
Ġe mpty
_ _
a me
V EX
Ġt ri
Ġtri angle
Ġarea s
S P
L NP
ef f
ĠL NP
ĠCHIP x
Ġn et
c onn
W ide
conn ect
0 6
h an
Ġ x
tive ly
pec tively
Ġres pectively
O RI
connect s
ecommend ed
o d
ith er
ĠL OGO
cep t
N H
Ġs ame
, "
H I
EX PAND
EX P
1 6
M upOvpMdn
p er
T I
per ty
Ġpro perty
m ent
ĠM aximum
R C
} }
M D
HV T
ĠO VER
o od
ĠE MPTY
g er
c u
ĠG ood
ĠT he
ĠM n
ĠCh eck
N ON
ou t
Ġcorner s
ĠT ypeBRS
Ġg ate
ĠV xMerged
Ġ1 6
Ġt wo
PO LY
)* !!
F P
ĠS LDB
Ġcheck ed
RI VER
D RIVER
re a
IND DMY
P R
Ġangle s
H P
th o
Ġw indow
ĠEX TE
ĠM upOvpMdn
A D
Ġg rid
Ġconnection s
ĠI MD
Ġv ia
ment s
Ġse g
Ġin clude
Ġseg ments
ĠCON VEX
on e
3 3
ver la
M top
Ġa cu
Ġacu te
ĠLAYER S
ĠA t
ĠCH ECK
S EALRING
e ither
p le
l ti
D OD
Ġmu lti
Ġc o
Ġor tho
Ġortho gon
Ġorthogon al
Ġn e
ĠR ecommended
E L
Ġmulti ple
a d
pp ing
V L
te pping
ĠV ia
ĠOF F
ĠOFF GRID
Ġin te
Ġinte ger
G rid
ĠL INE
b or
bor ing
igh boring
X X
NOT CH
A IVE
ĠVT L
R egion
ĠAL SO
B ig
Ġlayer s
Ġ z
Ġz one
ĠM UL
ĠMUL TI
Ġen han
Ġenhan ced
O L
Ġ ver
IN NER
E W
f or
))] )
0 8
d ge
E dge
W AIVE
r a
ĠGood Branch
ĠB ad
R ec
ĠOVER LA
ĠOVERLA P
2 7
Ġc on
= =
la te
L OWMEDN
HOLE S
Ġ op
verla p
N T
Ġs tepping
is t
Ġver tex
Ġne ighboring
Ġdoes n
Ġw h
ĠHV D
M DMY
Ġ DNW
i i
ER R
re d
Ġe VTL
ĠS Q
CH AR
CHAR GE
Ġt h
CO RNER
p o
ĠW ide
an ce
q u
ĠR H
Ġ(( (
Ġdi re
" ,
de gree
l l
d en
Ġ 6
P i
si te
N XX
ĠV TH
ĠISO R
B C
G H
Ġ i
Ġ H
Ġ1 8
ĠL UP
)*! ~(
ĠR PO
ĠD V
ĠC PO
Ġdire ction
po site
) .
Ġ /
L INE
l i
ĠE RR
ĠVT UL
M ET
Ġ2 0
ĠDM x
U VIA
TE X
ĠVIA y
HV D
Ġ3 6
EXC L
w ith
ĠMOM DMY
a tion
VIA x
Ġop posite
ol y
ĠPO ST
Ġ{ @
ĊĠĠĠĠĠ ĠĠĠĠ
D UM
O R
ĠSR DPO
S RAM
Ġ36 000
Ġa d
ĠU BM
x cept
EN C
PA D
Ġside s
ula r
Ġth at
ĠP W
ou ter
ĠIND DMY
c al
L OW
ĠR egion
OU TER
g ular
2 2
ĠN EW
Ġon ly
L V
S LDB
w ay
te ction
ĠM z
CO VL
PR OP
ĊĠĠĠĠĠ Ġ
Ġp late
Ġa way
ĠP P
Ġre ct
Ġin ter
w ide
A N
ĠSR M
Ġf o
DM x
E SD
ĠEXTE ND
ĠN T
Ġpro tection
CO RE
ĠM r
T his
ĠIN NER
ĠD RC
an d
u r
ĠE HVT
Ġr ing
E FP
Ġu s
Ġ 10
B DTCD
t ter
0 2
Ġfo llow
W I
in for
infor ced
Ġwith out
A X
R V
lea se
Ġ18 0
an gular
a c
) ,
S A
ER I
w all
N NH
OP C
ĠV AR
ĠD OD
5 0
clu d
ini mum
ĠR V
Ġin ner
ff er
ĠCO RNER
ĠD UVIA
U DE
w idth
Ġrect angular
J OG
Ġs t
id ate
c and
cand idate
ĠN P
Ġmetal s
ĠE SD
ĠVIA z
0 7
HI GH
u l
Ġpa tter
Ġpatter n
Ġ lo
RE F
ur n
ME TER
ERI METER
oly gon
is o
Ġa ll
Ġ outer
u ct
N MOS
ĠSRAM DMY
Ġlo cal
den se
Ġt urn
ER GE
Ġo verlap
ĠĊĠ Ġ
j ac
jac ent
a ct
S H
Ġus ed
Ġregion B
n d
A rea
ĠA N
ĠP ERIMETER
ĠENCLOS URE
a re
in ed
3 2
ĠVT U
Ġconnect s
n e
ch eck
E D
Ġfollow ing
pa rallel
T A
Ġ[ -
Ġa s
D VIA
ve red
B AD
Ġ[- =
ti o
Ġco vered
C E
ĠPO LY
R DB
Ġ 8
Ġan y
Ġex cept
ĠS L
ĠM u
Ġ HOLES
ĊĠ ĠĊĠ
S CH
t al
B Y
" :
RA Y
O NG
ĠSD I
ĠĠĠĠ Ġ
ĠEXTEND ED
SR M
ĠD PO
Ġs h
SD c
ĠCheck ed
A CT
ON UT
Mer ge
ĠD ONUT
ĊĊ ĊĊ
s s
D RC
0 3
ĠF or
AR RAY
P MOS
qu are
ĠC UT
Ġ ha
ĠI COVL
C on
I M
0 4
ST Pi
Ġinter act
ĠE FP
Ġi f
ĠSQ R
s ion
I B
F U
Ġto tal
ĠVIA r
L D
TEX T
W ITH
ND ER
Ġdi ffer
ĠL ONG
f ined
Con fined
Ġst r
u t
o th
ĠC T
Ġ )
Branch SingleVia
" )]
en sion
Ġ{{ {
ĊĠĠĠĠĠ ĠĠĠ
o g
N g
00 5
ar d
ĠE ND
Ġside wall
ĠVIA top
ĠRE C
FM x
o de
Ġf la
Ġfla g
Ġ DMY
L L
ĠM ERGE
Ġregion s
u ard
Ġstr uct
Ġstruct ure
R MDMY
R H
l d
D I
J T
ĠPW R
2 6
Ġseal ring
ĠVIA u
w indow
Ġre c
3 4
E MPTY
ist ance
Ġad jacent
F C
Ġh igh
V xMerged
Ġpa d
RE S
a p
an ne
1 9
eff ect
Ġrec ommend
Ġsh ou
Ġshou ld
anne l
ĠCB M
EN TER
ĠEXC L
ĠEXCL UDE
06 5
ĠEXTE NT
d i
W AR
WAR N
P P
U BM
FU SE
um b
umb er
ĠEXTENT S
B IB
m y
i t
7 0
M AX
I F
f er
PR OPERTY
s hape
ĠSR DOD
Ġb oth
ĠVTL N
check ing
CT M
)+! (
clud ing
er ance
U SH
)+! ~(
)*!! (
il l
Ġto l
Ġtol erance
Ġturn ing
FDM x
Ġwh en
)+ ~(
ul ly
R W
Ġs quare
Ġ end
A RE
U ARE
ĠCT M
ĠSQ UARE
Ġt ype
ĠU NDER
ĠUNDER O
ĠUNDERO VER
Ġf ully
IN SIDE
e inforced
S PA
Ġ+ -
PO ST
a tio
Ġ- =
ĠeVTL N
E SIDE
ĠA rea
um my
M AC
ĠeVTL P
Ġ1 25
] ,
Ġr atio
D D
} ]
ĠN O
ĠNO EMPTY
ĠR MDMY
k e
Ġwh i
C ON
ĠB ESIDE
Ġu se
O J
Ġ le
2 1
Ġo ver
F H
pa c
Ġedge s
0 1
t ension
ĠNOT CH
Ġcon s
ĠĊĠ ĠĠĠĠĠĠĠĠ
ĠNT N
ra w
DM z
ĠPR OJ
E S
H N
05 5
P W
Ġlength s
r t
V x
Ġ2 70
LOS E
ENC LOSE
Ġre fer
DV z
ĠD VIA
c k
DE D
DIO DE
M V
U D
ĠD TCD
p olygon
ĠGATE S
GATE S
ist or
ĠN OP
ĠNOP SE
ĠNOPSE UD
ĠNOPSEUD O
HI EL
HIEL DED
G OOD
th er
ĠC AD
te d
Ġd istance
Ġcons ec
Ġconsec u
Ġconsecu tive
ĠM inimum
Ġa pp
ĠS HIELDED
Ġres istor
ĠP USH
Ġapp li
IN J
ĠVTL P
Ġw ill
ĠAN ARRAY
Ġdiffer ent
E F
L N
ĠC ENTER
ĠL ength
m all
2 8
Ġt han
ĠR einforced
ĠĠĠĠ ĠĠ
v i
qu i
) )*!~(
m etal
ĊĊ ĊĊĠ
e xcept
Ġregion A
DV x
. )
ĠVTH N
/ ^
ĠA CT
DNW R
VT UL
HI A
S ING
SING LE
ĠP M
or t
DI S
E xcept
ĠVTUL N
Ġwindow s
7 2
vi ce
Ġde vice
Ġre qui
ĠĊĠ ĠĠ
Ġrequi red
pac ing
ĠACT IVE
ĠO VL
Ġhole s
) )*
Ġ Z
Ġs pacing
7 5
ĠP MET
OD AL
Ġo ther
3 1
clos ed
ĠV DD
ES F
a ch
M IN
DIS CHARGE
ĠEn closed
V AR
5 4
ĠVTH P
e VTL
DV r
Ġp lease
Ġd efinition
R PO
V TH
!! !!
Ġt i
ĠVTUL P
Ġu n
Ġ FM
JT DMY
ĠA VT
ĠVTU HN
Ġ low
Ġco re
M IM
ĠP lease
F D
u le
Ġdi ode
Ġha ve
)* ~(
TA GE
OL TAGE
5 3
. .
3 0
Ġ2 5
ĠVTU HP
Ġre inforced
Ġd ummy
Ġm aximum
x p
4 7
05 0
Ġex tension
I DE
M LV
E HVT
ĠO LD
ĠI n
F V
DM y
ĠD VIAx
M y
NOT ATE
Ġad d
ĊĠĠĠĠĠ ĠĠ
A T
27 0
Ġ1 2
i ck
)) )
ig ure
en er
Ġwhi le
ate d
Ġg ener
Ġvia s
ĠPA DM
ĠX OR
ĠV OLTAGE
Ġc an
ĠG M
J og
( (
Ġw ide
Ġd ef
rid ge
ĠS mall
h ort
g uard
hort E
hortE xp
R O
MAC RO
ĠC MACRO
v o
vo id
Ġin cluding
with in
M z
Ġa void
Ġ ~
Ġgener ated
ĠT ype
ĠCh ip
CON VEX
ĠSmall Jog
ĠS hortExp
ĠPA CT
AN NOTATE
M B
Ġ J
I t
Ġline s
Ġp olygon
Ġ K
G TE
with out
T S
Ġex clude
Ġti me
Ġ5 0
Ġ HIA
} )
o re
es s
ĠM V
ule R
Ġexclude RR
ĠexcludeRR uleR
ĠexcludeRRuleR ecommended
ĠV ER
ĠVER TEX
ĠRH PO
ĠR c
Ġflag s
ĠD IO
ST P
L UP
6 3
WARN ING
26 0
ĠDIO DMY
Ġm inimum
li ke
Ġ16 2
Ġ( !
} ,
Ġf igure
ĠB AD
Ġ( !!
late d
u ce
th ick
thick n
thickn ess
ĠG VIA
ĠCh annel
ĠĊĠ ĠĠĠĠ
M Y
ĠN ODAL
DEN SE
END IF
> =
3 5
PO OL
Ġha s
S S
DUM MY
RE C
G GE
ĠS T
Ġappli ed
ĠĊĠ ĠĠĠĠĠ
ĊĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
DM r
NW i
clud ed
I COVL
I C
2 00
IN K
DV y
Ġe ither
GGE R
ĠC A
l ine
10 00
8 5
ĠM up
ĠM dn
I GH
t wo
ĠĠĠĊĠ Ġ
ĊĠĠĠĠĠĠĠĠĠ Ġ
ĠS TA
ĠSTA MP
2 4
ar ge
ĠE ach
Ġ ,
Ġcon t
Ġ6 2
en ce
Ġd raw
o x
16 2
th e
r r
VIA top
PA CT
Ġ IO
Ġrecommend ation
ĠG B
Ġ 7
Ġb ent
o verlap
arge N
argeN umber
n o
ĠM IM
di tion
Ġg uard
V AL
j og
VAL U
VALU E
RA P
Ġ &
ĠL argeNumber
ul t
Ġb ut
I MP
AT CH
in ner
DE F
ST A
RW i
v ia
P S
M u
ATCH ING
I SO
ĠST RAP
ĠĠ ĊĠĠ
Ġwith in
no IND
EXCL UDE
A B
STA GGER
03 5
)) .
ĠI f
ra in
ĠMx R
VI CE
DE VICE
ĠVIAx Merged
ĠB JTDMY
Ġ1 5
ĠT OL
Ġa b
er ged
ĠC rt
SR DPO
ĠI t
Ġle ve
Ġleve l
ĠL V
a ult
ĠR F
L H
6 5
C PO
ĠType LE
ĠTypeLE H
ĠP MOS
Ġco ver
Ġbar s
{ {
ĠD i
i z
U NT
Ġt s
Ġts m
Ġtsm c
Ġre lated
Ġ IP
m aximum
E GTE
G B
Ġ 9
ĠN MOS
li c
ĠOD i
ĠA n
Ġcheck ing
SPA CE
T OP
EL SE
Ġr ot
Ġadd ed
< =
S B
N EW
L P
Ġ* !!
Ġpattern s
Ġdraw n
U S
ĠD ensity
L O
Ġv i
ĠM FUSE
Ġfor m
Ġ2 2
00 00
Ġcon dition
Ġs pec
a ge
Ġ8 5
Ġn umber
M C
Ġdef ault
ĠIND R
ĠL D
ĠLD P
ation s
ĠL DN
P INJ
N INJ
ĠRH OD
Ġthe re
ra tio
Ġspec i
D UVIA
O UT
ĠO U
ĠOU TER
verla y
ĠO verlay
ĠNW i
a i
lo g
N O
Ġcon f
ĠPAD H
n ot
id ed
4 4
11 5
e ll
C L
Ġ VI
HV DN
ĠVI MB
ĠI nd
ĠInd uce
ĠB ridge
0 25
te m
IF DEF
Ġconf ig
Ġconfig u
Ġconfigu ra
Ġconfigura tion
ĠS ide
ĠSide wall
ĠNW DMY
Ġc ut
" .
P DMY
Ġex cluded
ĠCB D
AP i
en ti
a rea
ĠDUM VIA
3 7
3 6
ĠNW EL
HVD P
raw ing
d rawing
T RI
UL K
TI ER
VT U
( )-
OD i
ĠMx y
Ġdiffer ence
Ġ :
V N
ec ted
B ULK
i B
AN ARRAY
DUM VIA
ĠO verlap
ĠM OS
ĠPO i
Ġn o
b id
Ġfor bid
Ġforbid den
ĠFM AX
on d
Ġs ection
Ġab o
Ġabo ve
Ġ{ (
ĠCH K
H G
EL L
Ġspeci al
W IDTH
e x
Ġm ore
NT N
!!!! <|
ĠCO UNT
ĠAn y
si g
Ġb ond
WI SR
Ġex cluding
TS MC
ĠS PA
ĠSPA CE
ect or
18 0
ai ve
5 5
ĠN ACT
ĠR ecommend
n ly
ĠO nly
Ġin d
Ġ8 75
ĠR OM
ĠN SDc
18 6
o la
ĠS RE
t s
ĠW B
ĠAP i
Ġwh ole
.. .
ĠE x
en ter
V i
ĊĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠD ACT
ĠN XX
P M
ĠU HVT
Ġp oly
ĠP SDc
)+ !!
Ġrecommend ed
ĠGATE D
ĠP STPi
si lic
C DMY
on g
ĠSRE SD
Ġt his
Ġcondition s
ĠESD IMP
sig n
5 0000
ĠA d
w aive
E OL
Ġpro ce
Ġproce ss
Ġw all
Ġc ell
Ġs iz
p in
P IN
ĠCO i
ĠT N
h ole
A VT
ch annel
ola tion
VN I
VNI X
OU ND
Ġle ss
UL L
nd er
MOM like
Ġm in
Ġ jog
W B
Ġind uct
Ġinduct or
silic ided
Ġu nder
Ġm erged
OUND AR
OUNDAR Y
PA SS
ĠOP C
ro ss
Ġex ist
ar k
ĠAd jacent
MOM DMY
U IDE
3 000
ĠN STPi
Ġde sign
Ġun silicided
Ġun it
Ġi t
ffer ent
di fferent
EN T
ĠT O
ĠHV NW
LA ST
P MET
Ġc a
R OD
M ID
s tepping
ĠE xcept
Ġ! ~(
a in
P SDc
N SDc
M ERGE
ĠN E
ĊĊ ĊĠ
P STPi
B OUNDARY
10 0
Ġ{{{ {{
c ap
h en
Ġp o
ĠW hen
/ ...
/... /
ĠR PDMY
PO i
rr or
W i
9 3
Ġop tion
ĠSR PO
M r
Ġ id
VIA T
Ġid enti
ĠM ATCHING
Ġsiz ing
g ate
SO L
S L
^ -
* (
) ^-
ĠC UP
ĠM IN
US ER
G UIDE
18 12
ĠEFP M
Ġwhi ch
ĠG RA
ĠGRA DI
ĠGRADI ENT
ĠAB SOL
ĠABSOL U
ĠABSOLU TE
R INK
Ġd en
Ġden se
Ġappli c
VTL N
SRAM DMY
Y M
W LD
CB M
ĠC umulative
N STPi
Ġa l
u nd
Ġcont ain
5 6
ĠĠĠĠ ĊĠĠĠĠĠĠ
15 5
Ġ3 0
v r
d vr
Ġ ĊĊĠ
Ġc enter
i ent
W R
R M
SI L
SIL IC
SILIC IDE
5 1
U HVT
Ġm i
Ġrot ation
Ġmi rror
at ype
at atype
Ġend cap
m ension
ST I
Ġbe low
m u
Ġ HOLE
in clude
PO D
O VE
L OGO
2 9
ĠP FD
ĊĊĊĊ ĊĊ
ĠR IGH
ĠRIGH T
ĊĊ ĊĠĠ
Ġor ient
Ġorient ation
ĠVIAx y
u al
Ġvertex es
ĠT OP
F I
07 5
ĠNE IGH
ĠNEIGH B
ĠNEIGHB OR
ti cal
ne ighboring
Ġc om
00 000
OL D
18 15
Ġ LE
ĠLE F
ĠLEF T
W DMY
Ġd rain
ro und
Ġform ed
C ENTER
ĠB OT
ĠBOT T
ĠBOTT OM
Ġa c
id d
idd le
25 33
d istance
AB OVE
S YM
L INK
T AP
ĠPO RES
Ġbe side
TE RACT
IN TERACT
)) ,
TS V
ĠN FD
N AN
ĠPO FUSE
CAP DMY
U B
PS UB
ĠD o
ĠT CDMY
Ġcheck s
Ġs ingle
ĠM AX
ĠEx tension
i r
ON GE
ONGE DGE
ou r
B JTDMY
F i
E B
Mx R
ĠA Y
ĠAY RE
RE ND
5 2
Ġne ed
EDGE B
EDGE A
si b
s sib
VTUL N
Ġgate s
our ce
l t
ĠPAD DMY
B iB
ĠP TAP
ĠNT AP
ol l
oll ector
il i
P I
ĠDi e
4 1
Ġb ridge
ĠMx s
ĠDefinition s
NAN O
FI LL
ACT IVE
8 0
Ġconn ected
ĠI LP
16 0
Ġapplic ation
Ġ ))
ON OS
Ġpo ssib
F HV
ĠPW ELL
Ġ REG
V ss
ĠL ay
f i
T ION
ĠWB DMY
ĠOVER U
ĠOVERU NDER
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
eVTL N
ĊĠĠĠ ĊĠĠ
ou nd
IND x
DV u
DM u
Ġrect angle
ĠM ax
Ġthe se
RA IN
DIO DMY
Ġc ou
Ġ LAST
NW EL
AB UT
rr ay
Ġcou n
HP M
Ġi tem
ĠRecommend ations
ĠLay out
s ame
ĠĠĠĠ ĠĊĠ
ĠDi mension
Ġ DE
5 000
Ġcoun ts
Ġof f
Ġ5 000
Ġ Q
Ġd atatype
3 8
25 18
Ġneed s
P lease
Ġa rray
ĠN OU
ĠNOU SE
B JT
or d
n on
0 15
Ġvi olation
VTH N
ĠPO S
6 0
d ummy
Ġdatatype s
it ch
VTL P
V pp
Ġe ach
m g
Ġch annel
}} ,
ĠCSR BIB
M A
CA D
RH OD
Ġm ark
E P
DM OS
ĠB JT
ĠW EL
ĠM T
mu n
N ACT
}} )
u st
T C
Ġ ?
OP TION
Ġp la
it s
Ġp itch
ĠP CL
SR PO
ĠM W
ĊĊ Ċ
V SS
an y
U N
M ATCHING
B O
ĠOD RES
ĠHV PSUB
Ġth en
4 0
ĠF HV
eVTL P
V DD
ĠRV i
ERR OR
SL R
ust om
ustom er
VTU HN
N ODAL
Ġdo w
Ġdow n
T OL
ow er
VTU HP
B L
line end
Ċ ĊĠĠĠ
ĠM in
ir cu
] .
RE CTANGLE
Ġc ross
ĠVIAy z
ti er
I G
25 5
c o
PO RES
Ġc ustomer
ĠRF DMY
u se
RE CT
t ri
IO VSS
8 3
ĠĠĠĠĠĠĠĠ Ġ
ĠRE S
VTUL P
H D
E NG
B TC
Ġdef ined
ĠP Pi
ĠU DM
ou s
RH PO
l ip
) }
ĠEMPTY i
fi ed
EMPTY i
) >
Ġpro j
Ġidenti fied
Ġt a
2 10
ĠP S
08 5
J TR
Ġf ill
ri me
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġoverlap s
Ġm iddle
Ġcont in
Ġcontin u
Ġcontinu ous
ĠLUP WDMY
7 9
Ġl ar
Ġlar ger
ĠF loating
ĠS quare
ĠĠĠĠ ĠĠĠ
ar y
Ġv al
LA SH
RV i
ĠX XX
ĠM ID
ĠS ingle
ĠIn ter
ut ted
4 9
Ġ2 4
ĠT CD
09 5
CB D
Ġ6 0
lt a
ing er
ri ve
d rive
ĠW AIVE
ĊĠĠĠ Ġ
m i
Ġm e
ĠMetal s
ĠE C
Ġ3 50000
Ġ25 00000
Ġ Ċ
oth er
ig n
RS TI
L VT
7 00
Ġm a
ĠB IB
RMDMY AP
pac it
VER TEX
Ġca pacit
Ġcapacit or
check ed
ĠCO OD
UN SILICIDE
CO IN
Ġs mall
Ġin t
Ġint o
ĠHV NMOS
4 2
ĠL DMOS
NTN i
e p
R einforced
R F
HP C
a g
Ġ ke
Ġke ep
Ġs ure
Ġma ke
03 0
ĠSL R
an t
6 6
R OM
ĠF EOL
W A
VTH P
RECT CD
B EOL
R D
ĠS H
ĠSH RINK
ĠP STP
ĠNW ROD
Ġ2 000
Ġ2 10
RD L
Ġde lta
ĠB JTR
U DMY
Ġc omm
ĠN STP
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ircu its
8 000
mi tter
LO AT
45 6
45 0
15 18
Ġ{{{ {
F use
g al
Ġ out
LOAT ING
L ong
Ġ )/
C rt
Ġout side
th es
thes e
m inimum
Ġh ig
Ġhig he
Ġhighe st
ĠDE CAPDMY
Ġ .
4 3
Ġpa rt
Ġre d
ĠP ar
ĠPar allel
)/ (
ĠM erged
ĠI tem
ĠEND CAP
ĠCO MB
Ġ JOG
o o
oo k
en c
AL OG
. (
Ġal ign
EXP c
EN W
ĠNTN i
ound ary
SR DOD
ĊĊĊĊ Ċ
c c
ĠV t
ĠMy z
Ġ2 60
VIA y
Ġs ur
Ġsur round
Ġf a
15 6
CUP CB
LD D
Ġver tical
AP RDL
Ġ8 0
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġin cluded
Ġg ro
Ġgro up
ĠB iB
ĠAN A
ili ty
ĠDV AR
ag ger
T N
Ġex cep
VIA z
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
Ġs ource
P L
12 33
ENG TE
90 0
Ġ90 0
Ġ45 6
Ġ4 3000
lo ck
T P
4 3000
ĠO TP
ĠHV OD
ĠDMx EXCL
y out
outer P
la yout
inner P
R FD
RFD RAIN
ĠĠĠĠ ĊĠĠ
ĠW BM
0 45
Ġalign ment
Ġmark s
Ġco ord
Ġcoord in
Ġcoordin ate
Ġcoordinate s
Ġrule s
ĠMetal Fuse
Ġrot ations
Ġb lock
st agger
C ELL
NW ROD
in side
Ġ }
ĊĠ Ċ
ec tive
ĠNW RES
CO PO
C OP
20 1
Ġp rime
T CH
Ġn ode
ac k
F or
Ġta pe
ĠT S
Ġpossib le
CUP VIAT
DMy z
F LOATING
ĠS PS
s pace
CON CA
CONCA VE
v id
vid ual
S Q
DM V
ĠĠĠ Ċ
Ġ~ ~
ĠCO PO
Ġ* !
ĊĠĠĠĠĠĠĠ ĊĠĠĠ
S RE
Ġin di
Ġindi vidual
ĠBDTCD DN
PI TCH
ĠDVIAx R
Ġf inger
Ġ3 5
12 0
ĠH ole
er i
HV A
8 4
Ġpla ce
Ġexist ence
Ġcom e
Ġplace ment
Ġle gal
ĠVTLN IO
ĠA SYM
2 000
FHV MOM
ĠPR L
Ġunder drive
Ġred uce
ĠF LASH
D ACT
ĠN umber
la mp
ĠHIA DMY
Ġ up
HV S
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
10 5
Ġ ĊĊĠĠ
PO S
ĠS A
ĠSA ME
tho de
' ),
7 6
Ġm es
Ġmes h
re gular
ri c
Ġ3 1
15 0
c ri
C G
Ġn on
ĠC D
ĠM ET
P ad
5 65
02 6
Ġm any
VIA r
ĠHV PO
axi mun
EP GTE
VIA u
ĠPAD i
C ircuits
SH RINK
C ollector
Ġus age
Ġin j
Ġinj ector
ĠCOP USH
s ed
V PO
TH IN
ĠL ONGEDGE
Ġ4 000
C OD
4 000
ĠDEN SE
SRE Z
OR TH
LV MOS
ĠCD UDMY
PAD H
ĠP ower
ĠC lamp
HP L
ESD IMP
CB i
BL K
Ġeff ective
L ONGEDGE
Ġ10 0
GATE D
B P
Ġsh ort
Ġ HIGH
HV NW
ĠVTHN i
ĠVTH Pi
B oundary
CHIP x
ĠĠ ĊĊĠ
Ġac ross
ĠE S
ĠES F
Ġse l
SO U
COD OD
ĠF lip
Ġm is
ĠVTULN i
ĠVTUL Pi
p r
ĠCT MDMY
cri tical
3 9
ĠWB VIA
ĠRH DMY
Ġti le
um p
DVy z
Ġf u
Ġfu ll
n ing
ap NTNi
N CH
o lated
g B
g A
VTL i
M FUSE
IP DMY
ĠVTLN i
ĠVTL Pi
ure d
olt age
C h
ĠĠĠĠĠĠ ĊĠĠ
ĠR NWEL
ĠN C
UT T
N INDx
B TSV
ĠFM ONOS
ĠCB i
W CL
B IG
ot al
ĠD BO
ĠDBO C
rt ual
as ured
Ch ip
ĠNOUSE M
ĊĊĊĊ ĊĊĊĊĊĊ
m m
HPM LP
re fer
Ġidenti cal
E mitter
ct angle
Ġvi rtual
ĠVAR i
ĠT otal
AR K
ĠN CH
ĠHV PMOS
as k
ark er
Ġ2 00
an ced
al anced
CON NECTED
HV PW
) =
ensi tive
ar ning
M ore
L ONG
6 1
Ġst ack
Ġproj ection
l ength
4 8
ĠPR BOUNDARY
R U
6 7
% .
O VL
)] .
ĠN POD
ĠCUP VIAT
Ġthe m
ĠODi RFDRAIN
L PP
H C
DMx y
ĠN SD
or iz
oriz on
orizon tal
SD I
ĠĠĠĠĠĠĠ ĊĊĠĠ
Ġ{{{{{ {
Ġsel ected
Ġfill ing
ĠUBM i
ĠT RU
ĠTRU NC
ĠTRUNC ATE
ĠMET AL
um x
enti al
Ġval u
Ġvalu e
Ġp ot
ĠP SD
ĠCH VT
ct ly
LVT i
Ġpot ential
Ġh orizontal
ĠNOUSE V
ĠNW RSTI
g U
LO X
10 8
Ġ8 000
M W
)] ,
Ġpa r
Ġne are
Ġneare st
i m
R PDMY
ĠN Pi
ĠHV MOS
Ġf i
ĠT ol
ĠTol er
ĠToler ant
ĠE FUSE
PP I
ĠS PI
ĠSPI CE
Ġ he
O X
ĠĠ ĊĊĊĠ
ti c
U SE
Ġl on
Ġlon ger
ĠB TSV
SOU RC
SOURC E
ĠD GATE
Ġb rea
Ġbrea ch
CBD i
Ġlow er
ĠR ect
ĠHV OX
igh t
ĠVTUHP i
ĠVTUHN i
ĠD CO
Ġb alanced
Ġan other
d my
S ERI
SERI ES
ĠVT Z
ĠAN ALOG
7 8
ĠSING LE
Ġ6 50000
Ġ DEF
n ode
UL P
ST ACK
P STP
CO UNT
Ġturn ed
ĠPO C
ĠP oly
ĠC AP
ĠCAP DMY
DEN SITY
Ġv oltage
S K
Ġ1 54
PO FUSE
NO CAP
at ch
M aximum
Ġbut ted
a thode
Ġfo llowed
Ġdire ctly
Ġ[ (
ĠPW EL
ĠC G
me asured
TE NT
EX TENT
ĠR W
Ġ k
A x
. ,
ĠG L
ĠDNW i
Ġ* (
B R
ĊĠĠĠ ĠĊĠ
u ide
uide line
tic le
5 7
Ġpossib ility
Ġpar ticle
Ġg uideline
Ġca u
Ġcau sed
d rain
IC K
Ġ ran
Ġran ge
ĠS K
ĠSK IP
ĠP POD
ĠO ther
c ided
Ġm ask
ĠA NT
ti li
S HO
ĠMFUSE LINK
ĠFHV MOM
VIRT U
VIRTU AL
V OD
ĠV x
REA L
' )
y mm
ymm et
ymmet ric
ĠPO cc
ĠHV BJT
REC VIA
Ġ10 700
10 700
Ġs ol
Ġ( {
NW DMY
ĠS P
Ġ THIN
} .
Ġo x
Ġox ide
Ġad dition
ĠOD W
ĠF USE
ĠFUSE LINK
ND EF
IF NDEF
Ġis olation
ĠA c
Ġstack ed
ĠRPO i
SH K
ĠA ll
Ġs ili
Ġfi le
Ġex p
Ġcomm and
ĠOD WR
ĠM FU
i c
Ġsili cided
ĠĠĠĠ ĠĠĊĠ
Ġthem se
Ġthemse l
Ġthemsel ve
Ġthemselve s
Ġsol id
Ġcustomer s
Ġac c
ĠODi SRAM
TY P
TYP E
TA TYPE
T DMY
D A
DA TATYPE
COP Y
Ġk ind
OD PO
4 6
Ġdraw ing
OG IC
BO ND
ĠW I
ĠWI RE
ĠC ap
LUP WDMY
ĠCO ii
. ]
Ġ((( ((
N PO
ĠF CDMY
N V
0 22
ĠRect angular
00 2
ĠF OD
N STP
8 1
Ġcomm on
4 00
ĠW ith
M R
Ġfill ed
Ġ6 00000
Ġ4 00
x c
HV MOS
Ġu tili
Ġpa ck
Ġpack age
Ġi mp
ĠR e
a tive
Ġb ump
ĠTS V
ĠS ource
ĠCO R
12 2
Ġproj ect
Ġo d
Ġod d
Ġhe ight
Ġfa ce
Ġface s
Ġexcep ted
Ġab utted
ĠType H
ĠTypeH ook
ĠType C
ĠM iddle
ĠH ook
ĠC u
ĠC om
ĠCom b
ĠC IC
ĠB P
ĠAn other
ĊĠĠĊĠ ĠĠĊĠ
m arker
W s
W c
TH ICK
THICK N
THICKN ES
THICKNES S
M FU
ĠB IG
re gion
in al
SQ VIA
Ġinter s
ĠS EN
Ġval id
Ġvalid ation
Ġf inal
ĠG ate
Ġ10 00
ISO DMY
D VIAx
8 9
) ;
M ARK
H VI
Ġt one
Ġre ver
Ġrever se
Ġ8 3
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
lo t
IO PAD
Ġs lot
Ġp ut
D rain
N ECT
CON NECT
ĠS B
ĠE mpty
ĠCUP CB
F VIA
Ġo ctangle
t re
UT MDMY
ĠPM i
ST OR
SI STOR
RE SISTOR
( !!
Ġstructure s
ĠCBD i
ĠNC apNTNi
ĠCOi SRAM
Ġ((( (
Ġp ower
Ġm VTLi
Ġf ound
Ġd up
Ġdup lic
Ġduplic ate
ĠRF IPDMY
ĠPOi SRAM
ĠMu st
s quare
edge M
SP S
P Pi
NP i
L C
DVx y
Ġinters ect
NW RSTI
M n
Ġintersect ing
Ġacc ord
Ġaccord ing
V MIN
V MAX
RS T
O ND
EC OND
ĠPO n
ĠCT C
R ule
ĠVTLNIO i
ĠSEN DMY
3 75
U DM
Ġm ini
Ġmini mun
Ġexcep tion
ĠO pp
ĠOpp o
ĠOppo site
ĠCO WR
ĊĠĠĠ ĊĊĠĠ
m aximun
N R
D OT
D FM
04 4
) }}
Ġ REAL
P CL
MA SK
ĠRe gular
D RAIN
Ġw an
Ġwan ts
Ġv ar
END CAP
) :
Ġpla ced
m id
AN A
Ġutili ty
Ġal ong
ĠNW LVTi
TER M
M F
ĠT o
ĠM A
ol d
Ġvi olated
Ġcom p
Ġcomp ly
ĠRMDMY AP
ĠAVT P
se m
sem b
semb ly
C K
Ġf lip
ĠU n
Ġlay out
ĠNW ii
Ġ5 0000
Ġ old
n co
4 45
ĠP ad
} .)
RMDMY n
ĠĠĠĠ ĊĠĠĠ
Ġn ative
ĠPO EN
P ERIMETER
c enter
ĠL MARK
Ġe HVT
Ġan ode
Ġlea k
Ġleak age
ĠPA TH
5 05
Ġpotential s
Ġcont act
W RV
Ġg round
tre me
ĠD ummy
th od
T O
N A
ĠB UTT
ĠA s
op posite
HO C
Ġmark er
ĠHV PW
in t
17 5
) (
ĠĠĠĠ ĠĠĠĊĠĠ
ĠDEF INE
ĠCO RE
ĊĊĊĊĊĊ Ċ
s ensitive
M OD
L DN
9 9
Ġst ar
Ġstar ts
ĠEx cep
ĠExcep tion
N IND
Ġsurround ed
ĠOD xc
ĠOD s
di ff
GATE c
F OD
CSR BIB
45 5
Ġc ollector
lt ra
d ef
LD P
Ġus er
Ġ 75
s ingle
Ġus ing
Ġu ltra
ĠTS MC
s ure
s o
or y
ED G
23 5
Ġstr ong
Ġstrong ly
ĠCO G
act or
R NG
ANA PO
65 00
Ġs hape
Ġm m
ĠR R
AN ALOG
ĠS C
ĠC My
ĠC Mx
Ġ3 7
PPI i
EP SD
ĠCO EN
0 17
mu st
PL US
OD Y
B ODY
ĠT RI
ĠNW R
ow n
d atatype
SQ R
G C
Ġ5 5
ecommend ation
R ecommendation
Ġvar actor
Ġ y
b ility
Ġop en
ĠVIA T
P CH
Ġpo int
Ġm ode
Ġmode l
ĠC RAM
8 2
ĠS SD
ĠERR OR
ĠA R
ĠAR RAY
ĠI MP
e w
)} .
" )-
ĠD rain
ĠCSR must
Ġ UTMDMY
Ġre l
Ġrel ia
Ġrelia bility
Ġpro h
Ġproh i
Ġprohi b
Ġapplic ations
0 90
Ġprohib i
Ġprohibi ted
Ġdi mension
Ġdi e
ĠTRI GGER
ĠM aximun
PA node
NC athode
Ġw arning
Ġs im
ĠP ro
ĠPro tection
clos e
M b
m atch
P eri
DV AR
Ġring s
Ġmis match
Ġme m
Ġmem ory
Ġen close
ĠOD S
}} .
x x
o se
K A
G R
ĠODW LOX
PO DOD
N ot
05 2
Ġtype s
Ġa de
Ġade qu
Ġadequ ate
T he
P RE
ĠPO DN
t ype
RE D
O C
MF E
MFE RED
DB OC
CSR DMY
CH A
CHA MFERED
Ġsurround ing
ĠD I
Ġ2 8
U RT
SHO URT
S LDD
PO s
OD s
Ġ4 0
RF DMY
Ġb u
ĠP CH
ĠF DI
ĠC EN
ĠCEN TE
ĠCENTE RS
u n
COP USH
Ġcon c
ĠW arning
Ġ3 8
VTULN i
VTUL Pi
VTLN i
VTL Pi
DE CAPDMY
CH VT
ĠĠĠĠĠĠ ĊĊĠ
Ġun B
ĠunB al
Ġnet s
Ġcell s
Ġbu ffer
Ġal so
ĠL BR
VT Z
PO VER
I LP
7 7
0 14
} [
V OLTAGE
ĠUn it
VN V
N POD
LLE CT
99 5
ĠPO R
ĠDI E
t act
ra p
e xp
ap NTN
SH AP
SHAP E
IN AL
F INAL
EN SD
Ġ[! (
ĠF ESF
ĠDV PA
ĠDVPA RAM
ĠDVPARAM S
ĠAN NOTATE
ĊĊĊĊ ĊĠ
s id
and ing
VTHN i
VTH Pi
T AL
R IZ
RIZ ON
RIZON TAL
OT P
NW ii
HO RIZONTAL
B UTT
Ġ{ ((
ĊĠĠĠĠĠĠĠĠĠ ĠĠ
{ @
Ġy ou
Ġen sure
Ġc ur
Ġcur r
Ġcurr ent
VTLN IO
L TA
Ġ( >=
C ore
D GATE
ĠC ollector
la p
er lap
Ov erlap
00 12
Ġopen ing
Ġl ong
VIAx R
Ġfollow s
ĠNXX HPL
I n
2 25
Ġre la
Ġrela tive
ĠVia s
e ld
P NP
FM ONOS
Ġp er
Ġidentical ly
S C
OD RES
F LASH
Ġdevice s
ĠF igure
t ing
P HVNW
PHVNW HVPW
Ġme thod
Ġerr or
Ġconn n
CO i
PO C
ĠĠĠĊĠ ĠĠ
c y
M etal
ĠST D
ĠF I
Ġac cu
Ġaccu ra
Ġaccura cy
ĠL OGIC
ĠAB S
" ))
Ġspeci fi
Ġspecifi c
Ġs eri
Ġseri es
Ġl anding
Ġconnn ected
ĠE CC
ĠDACT G
A NT
Ġcom ple
Ġcomple te
ĠOD IMP
Ġ3 9
F ESF
Ġp ick
ĠH BL
H ER
FUSE LINK
DNW i
ĠN f
ĠCTM FINAL
p end
li ef
OT HER
Ġe qui
ĠLONG P
ĠB utted
k en
b y
b utted
V c
IN EN
EX G
B EDGE
ĠĊĠ ĠĊĠ
Ġover drive
Ġ1 4
Ġ((((( ((
def ault
OTHER S
CD U
Ġth ose
Ġtape out
Ġta ken
Ġsh i
Ġme an
Ġfa b
Ġfab ric
Ġfabric ation
Ġexp lic
Ġexplic it
Ġexplicit ly
Ġexp la
Ġexpla in
Ġequi v
Ġequiv al
Ġequival ent
Ġcons id
Ġconsid er
Ġconsider s
Ġcon side
Ġconside red
Ġc re
Ġcre ate
Ġc are
ĠW S
ĠOD cc
ĠEx treme
ĠCO Merged
ĠC I
Ġ eng
Ġeng ine
Ġengine er
un ion
um X
s a
m VTLi
eff EDGE
WB DMY
VT N
VAR i
RPO i
RH DMY
RF IPDMY
ODi SRAM
ODi RFDRAIN
NC apNTNi
HIA DMY
CD UDMY
Ġof fer
Ġb its
ĠPOLY c
ĠN ode
ĠAc tive
tact s
is e
SA ME
M G
Con tacts
Ġc lu
Ġclu s
Ġclus ter
ĠE MOD
ex c
6 2
Ġth ick
Ġe mitter
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
Ġw ell
Ġa llow
ĠNP WR
ĠNC apNTN
hole x
f inger
S pace
PAD DMY
MFUSE LINK
LC SP
EFP VIA
E FUSE
Ġl i
ĠHV N
W D
ANGLE D
ĊĊĊĊ ĊĊĊĊ
VTUHP i
VTUHN i
VTLNIO i
NP N
N HVPW
NHVPW DNW
15 17
% )
Ġop er
ĠAs sembly
Ġ HP
}} }
Ġm atch
Ġmatch ing
ĠSR D
ĠREC VIA
ĠPWEL i
x i
P LDD
L DMOS
D S
A NC
ĠB al
S CO
D CO
ĠH R
Ġ15 5
N LDD
18 33
18 25
13 17
ĠW IDE
ĠF VIA
Ġca thode
ĠG DS
di ode
M ONOS
L OGIC
FC DMY
F igure
DIS CONNECT
9 10
Ġc ircuits
ISO R
ĠT h
ĠH BC
re ctangle
f ter
UT M
P C
PC athode
NA node
Ġp eri
ĠV pp
a b
RT O
MET AL
Ġst re
Ġstre ss
ĠS ECOND
ĠFI RST
Y NC
SHO RT
S ECOND
LO CK
HV OD
FI RST
B LOCK
Ġst and
Ġsiz e
Ġre lief
Ġdef ine
Ġa fter
in ter
d own
C OS
Ġspace s
Ġper pend
Ġperpend ic
Ġperpendic ular
Ġimp l
Ġimpl ant
ĠOD BLK
Ġ1 7
38 9
Ġcross ing
ĠS TI
ĠR TO
ĠFHV PO
ĠC M
ĠD P
u b
in cluding
X N
W idth
U XN
M UXN
29 7
19 2
Ġ1 40
d s
POLY IM
POLYIM IDE
ĠW OW
ĠRR DMY
ĠE MB
a il
UM P
NW LVTi
Ġd et
Ġdet ail
Ġdetail s
ĠFMONOS CELL
ĠD STP
ĠC ore
ĠB ump
N SCH
Ġt ran
Ġtran s
Ġtrans istor
ĠM ONOS
|> <|
z e
si ze
og n
in k
ch ing
SIZ ING
OM ARK
N OMARK
EF HV
15 4
Ġg ds
ĠE GTE
Ġs wi
Ġswi t
Ġswit ch
Ġne ar
ĠPO BLK
ĠI s
d er
W S
R OW
L S
G L
CO OD
Ġmis sed
Ġind uce
Ġfa il
Ġcheck er
Ġb ack
ĠPO W
ĠL INEN
ĠGATE P
ĠDE P
for m
R RAM
M I
MI SS
GATE W
C u
Ġgener al
Ġa round
ĠVOLTAGE S
ĠFDI R
ĠDEF A
ĠDEFA UL
ĠDEFAUL T
ĠAP B
Ġ16 6
PO BLK
NOT CHECK
C RAM
5 9
Ġeff Region
ĠGATE N
c ore
W LOX
Ġsim ula
Ġsimula tion
Ġs hapes
Ġs M
Ġc ircu
Ġcircu it
ĠGATE W
ĠDE LTA
ĠCO S
ĠCO M
ĠC ell
W OS
WOS LDB
POi SRAM
PA TH
M arker
EL OW
D STP
COi SRAM
0 115
ĠU se
ĠS YM
ĠN OG
ĠNOG T
Ġ High
Ġ %
ĊĠĠ ĊĊĠ
me ter
h v
UBM i
CO ii
Ġst d
Ġmis s
Ġmiss ing
Ġf ew
Ġfew er
ĠF LA
S EN
N FD
H BC
Ġth in
Ġstand ard
Ġpolygon s
Ġf ir
Ġfir st
ĠWAIVE D
ĠW LCSP
ĠRH WR
ĠN e
ĠNe ighboring
ĠN ON
ĠL B
ĠE PMOS
ĠE NMOS
ĠE N
ĠCM s
ĠB AR
ule s
r ules
V A
R y
R x
EDGE x
C Mx
Ġre m
Ġno ise
ĠN V
ĠCO x
RHOD R
H BL
C I
B ESIDE
AVT P
Ġs et
Ġo c
Ġoc cu
Ġoccu r
Ġoccur red
Ġin c
ĠIs olated
CT C
6 4
Ġor der
ĠU SE
ĠNE VER
ĠM SLDD
pr Boundary
im ide
M O
Ġli ke
ĠV NV
9 2
Ġrec ogn
ĠS ymmetric
Ġ18 15
o co
n N
nN oco
TE N
Ġset ting
Ġrecogn iz
Ġrecogniz ed
Ġperi meter
Ġoper at
Ġoperat ing
Ġconc er
ĠT urn
ĠTurn s
ĠR O
ĠRO DMY
ĠNW LVT
Ġ6 4
i tem
f t
] >=
S ensitive
D F
Ġun ion
ĠRPDMY ai
ĠM G
ĠFMONOS DMY
ĠB E
O UTSIDE
L B
ĠR CG
ĠRCG C
FM O
Ġex t
ĠS Z
Ġ18 12
Ġlo g
Ġ[ {
ĠW LD
ĠCO LLECT
Z MOS
VIAy z
U i
TOP DMY
Ġas sembly
Ġ il
Ġil le
Ġille gal
GB i
GATE P
Ġcover s
ĠP rime
# #
Ġst rap
Ġext end
ĠW RV
W LP
S t
L BR
A c
ĠRV B
ĠN on
Ġpick up
Ġb oundary
ĠR ec
ĠLV F
ink OPC
RPO DIODE
POLY c
NT AP
L inkOPC
L IP
HV BJT
ĠAs ymmetric
Ġ ##
er v
W C
OD S
NW RES
GATE N
6 9
Ġdi ff
Ġdiff u
Ġdiffu sion
ĠRE D
ĠRED U
ĠREDU ND
ĠREDUND ANC
ĠREDUNDANC Y
ĠR U
ĠRU LE
ĠNON WR
ĠIMP LE
ĠIMPLE M
ĠIMPLEM EN
ĠIMPLEMEN TA
ĠIMPLEMENTA TION
ĠG UIDE
ĠGUIDE LINE
ĠEMB ED
ĠEMBED DED
e al
St rap
R P
L T
F UTM
EX GATE
Ġsim ult
Ġsimult an
Ġsimultan e
ĠSEALRING i
ĠRPO DIODE
a ve
RPO x
F DI
CO LLECT
Ġconc ave
ĠUTMDMY x
ĠFM OD
Ġ \
r al
ent ral
U H
Ġred und
ĠOD n
PM i
F PO
B A
Ġsh own
Ġnumber s
Ġnear by
Ġinteract s
Ġfinger s
Ġex treme
Ġ1 23
le g
RA L
N CHK
ENT RAL
E G
Ġs ha
Ġsha re
Ġimp ort
Ġimport ant
ĠCG POVER
ĠB es
inter act
ST D
NON WR
E rror
69 6
Ġmean s
Ġinter connect
Ġe v
Ġev en
ĠE ver
ĠEver y
ĠBes ide
ĠBeside s
ri an
NACT x
E MOD
B OT
13 5
- ,
Ġshi eld
ĠeHVT P
Ġe qu
Ġequ al
Ġbet ter
Ġ25 33
Ġ25 18
l s
7 1
Ġvi ce
Ġver sa
Ġf POLY
Ġextend ing
Ġdiffusion s
ĠF LOATING
ĠB ER
RHPO R
P TAP
OD BLK
F loat
EXG S
EP T
B TE
AR ROW
16 5
)*( !!
Ġnot ch
Ġm ac
Ġmac ro
Ġcontact s
Ġas ymmetric
ĠRF IP
ĠPO jog
ĠLV NW
vi olation
ul k
pre c
prec is
precis ion
g ood
FHV PO
11 7
Ġ{{{{{ {{
Ġ{{ "
Ġhe ad
Ġa ct
Ġ[ ~(
ĠWS y
ĠWS x
ĠW SR
ĠVT C
ĠP X
ĠN X
ĠFLA G
ĠEXC EPT
ĠA SP
ĠASP ECT
Ġ16 000
Ġ16 00
pa d
l ed
ab led
W EL
VIAx y
SOU R
S HIELDED
PR OJ
PROJ ECT
FMONOS CELL
C UT
37 6
3 05
165 00
155 00
02 1
Ġto u
Ġs um
Ġl arge
Ġex act
Ġcons erv
Ġconcer n
Ġb all
ĠSYM MET
ĠSYMMET RI
ĠSYMMETRI C
ĠPO s
ĠFHV OD
Ġ& &
] ==
In ter
B CO
7 84
Ġrem ain
Ġo verla
Ġoverla pp
Ġoverlapp ed
Ġme asured
Ġconn ec
Ġconnec ti
Ġconnecti vi
Ġconnectivi ty
Ġbuffer s
Ġb ulk
Ġb od
Ġbod y
Ġas sign
ĠV oltage
ĠTh at
ĠSRDOD x
ĠRec omm
ĠRecomm ed
ĠRecommed ed
ĠR UN
ĠL C
ĠH G
ĠFDI F
ĠDNW EN
ĠBE VE
ĠBEVE L
Ġ15 6
Ġ1 3000
s b
def ine
W O
V CA
D rian
C OM
23 80
2 05
13 000
10 000
ĠĠ Ċ
Ġs om
Ġsom e
Ġmethod o
Ġmethodo log
Ġmethodolog y
Ġin clud
Ġinclud es
Ġf low
ĠHVN OD
ĠD istance
ĠB TC
Ġ3 2
s et
ro perty
re ction
r ad
p roperty
i ty
SB D
PA DM
P POD
NW LVT
FHV OD
EN MOS
Ġw aive
Ġv ola
Ġvola t
Ġvolat age
Ġsimultane ou
Ġsimultaneou se
Ġsimultaneouse ly
Ġshi ft
Ġse ar
Ġsear ching
Ġrot ated
Ġp r
Ġoff set
Ġlog ic
Ġflag ged
Ġcom pa
Ġact ual
Ġactual ly
ĠN ew
ĠF G
ĠCI CAP
ĠC entral
Ġ36 0
Ġ3 00
Ġ ULL
ĊĠ ĊĠ
sig m
sigm a
di rection
WITH OUT
W W
W OW
U se
F LIP
C ENTRAL
A ND
+ )
Ġm ay
Ġinc re
Ġd ensi
Ġdensi ti
Ġdensiti es
ĠSRDPO x
Ġ j
cu t
WW GC
CHK x
Ġf use
Ġad op
Ġadop ted
ĠV U
ĠP HIA
ĠN HIA
ĠH U
ĠH T
ĠEX GATE
Ġ3 0000
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
gre es
] [
S mall
P ERI
PERI M
In ner
B JTR
9 1
DRC DMY
10 2
10 1
Ġn ec
Ġnec ess
Ġnecess ary
Ġerror s
ĠS YNC
ĠM e
ĠMe thod
ĠB UMP
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
de grees
S YNC
PO DN
IN TER
DE LTA
C NT
ALL REGION
Ġp ur
Ġpur po
Ġpurpo se
Ġby pa
Ġbypa ss
ĠGATE i
ĠDCO DMY
Ġ3 3
Ġ1 50
TE VA
OT ATE
H RI
DPO s
ĠSRE Z
ĠPoly imide
ĠMA Y
ĠFHV PSUB
ĠA nd
PO L
BA SE
Ġ5 00
Ġ TEXT
th is
n al
N I
HV PSUB
FDI R
CC G
00 4
. :
( )]
Ġ{( [
Ġw ay
Ġs ch
Ġsch e
Ġsche me
Ġresistor s
Ġpa ir
Ġis olated
Ġinter nal
Ġab ut
ĠTh in
ĠN et
ĠN AVT
ĠMetalFuse LinkOPC
ĠHV F
ĠB OUNDARY
Ġ3 4
Ġ2 50
Ġ '
silic ide
n silicide
area R
Y AN
V ol
U nsilicide
REA K
OD xc
Metal Fuse
M SLDD
FHV NW
B REAK
00 6
Ġpa ss
Ġl im
Ġlim it
Ġd is
ĠRect angle
ĠPSDc nco
ĠNSDc nco
ĠFHV NW
Ġ text
l v
P oly
Ġch anne
ĠW LOX
ĠR atio
ĠR RAM
ĠPO EX
ĠPO A
Ġ( >
Ġ ĊĊ
ot t
c up
Small Jog
S hortExp
P rime
D LDD
B UMP
8 64
6 08
43 04
4 19
419 4304
38 8
3 04
29 1
19 4
00 7
ĠĊĠĠĠĠĠ ĠĊĠĠĠ
Ġdis abled
ĠV ol
ĠLV PO
ĠB ELOW
ĠAd d
ĠAB OVE
conn ection
NW GC
M id
B ELOW
Ġpair s
Ġfi eld
ĠW ERR
ĠR FC
ĠP ER
ĠPER P
ĠPERP END
ĠPERPEND IC
ĠPERPENDIC ULAR
ĠO ne
ĠLV OD
ĠE G
Ġ6 5
Ġ HPC
c nNoco
S CT
RV B
R B
PW R
O DE
NON OPC
LV OD
LE T
LE AR
GR MV
C LEAR
Ġto ge
Ġtoge ther
Ġexist s
Ġbe f
Ġbef ore
ĠPOjog A
ĠNXX HPM
ĠFDIF VER
ĠF PO
ĠA l
ab le
C OG
ĠeHVT N
Ġallow d
Ġallowd ed
ĠE LVT
ĠAN TEN
ĠANTEN NA
Ġ ULP
u M
or re
SIDE i
OP E
H ANC
HANC E
FHV PSUB
EN HANCE
Ġun i
ĠUBM B
ĠSB D
ĠCENTER LINE
te st
W L
S eal
LV S
B utted
AP B
Ġtou ching
Ġgate d
ĠSD x
ĠM U
ĠMU ST
ĠHV DIO
ĠEG D
ĊĊĊĊ ĊĊĊĊĊ
t ra
r isk
c nco
EG DE
CG POVER
B D
ĠT able
ĠC onn
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
SRE SD
RPDMY ai
PW EL
MV HV
Ġs ymmetric
Ġmethod s
Ġg et
Ġget s
Ġac tive
ĠHV ZMOS
ĠH i
ĠH RI
ĠB a
Ġ Jog
f loat
PO cc
P T
O B
5 8
4 05
26 5
14 4
ĠĊĠĠĠĠĠĠĠĠĠ Ġ
Ġt ar
Ġtar g
Ġtarg et
Ġredund an
ĠUn b
ĠUnb alanced
ĠNWROD R
ĠCO s
Ġ8 9
on ly
n m
m in
inter connect
b e
V DMY
S ource
OD W
CO x
Ġwh ose
ĠP BR
ĠN DD
ĠF UTM
in PW
ad jacent
P ICK
PICK UP
I S
HV PO
8 8
10 11
04 0
Ġredundan c
Ġredundanc i
Ġredundanci es
Ġme et
Ġb as
Ġbas ed
ĠR OTATE
ĠP B
ĠN o
ĠMG POVER
ĠF ully
Ġ6 00
Ġ4 1
we ll
v ed
cri be
ai ved
V PW
PO R
P SD
Inter connect
9 5
ĠĊĠ ĠĠĠ
Ġuni form
Ġunder o
Ġundero ver
Ġse e
Ġpoly imide
Ġinter connection
Ġg rad
Ġgrad ient
ĠV PP
ĠR Wi
ĠE ff
ĠCUP M
ĠBa se
re e
r ated
pa rated
e lta
O Z
NO DE
N S
MB F
CUP M
AL F
00 9
Ġw aived
Ġshield ing
Ġs u
Ġincre ment
Ġex po
Ġexpo sure
Ġde ter
ĠRR TE
ĠPSTP n
ĠPSD n
ĠNSTP n
ĠNSD n
ĠEff ect
w ise
ott om
WB VIA
V NW
S U
S SD
EXD i
DACT G
CO R
ĠĠĠĊĠ ĠĠĠĠĠĠĠĠ
Ġth ree
Ġst ra
Ġsel ect
Ġper form
Ġperform ance
Ġoper ation
Ġli mi
Ġlimi ted
Ġexception al
Ġdimension s
Ġb it
Ġany one
ĠThe re
ĠSL OPE
ĠPSD u
ĠNSD u
ĠNACT x
ĠG uard
ĠG ROW
ĠD RAIN
ĠCT CCG
ĠCG D
ĠC SD
ĠAN R
Ġ ID
c an
SRDPO x
OD cc
FOD WLOX
F G
DN UT
0 20
Ġvoltage s
Ġvar i
Ġvari ed
Ġs cribe
Ġr ign
Ġn we
Ġnwe ls
Ġdeter min
Ġdetermin ation
Ġconserv ative
Ġbut ting
ĠW L
ĠP itch
ĠN ARROW
ĠMA SK
ĠIn side
ĠH NW
ĠH ALF
ĠDummy TCD
ĠB ut
Ġ( {{
Ġ round
Ġ TEVA
x mm
orre ct
mm xmm
] (
SU GGE
SUGGE S
SUGGES TED
N ARROW
MOS OD
L INEN
IN OD
6 8
4 65
08 2
04 65
ĠĠĠĊĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠ ĊĊĊĠ
Ġw he
Ġwhe re
Ġwhere ver
Ġtile s
Ġsu ch
Ġstra pping
Ġst or
Ġstor age
Ġst ag
Ġstag ge
Ġstagge red
Ġshort en
Ġshorten ing
Ġshield ed
Ġsh or
Ġshor ter
Ġse parated
Ġs pre
Ġspre ad
Ġredund ant
Ġp diff
Ġn diff
Ġl v
Ġlv s
Ġjog s
Ġinc rea
Ġincrea se
Ġimp o
Ġimpo ssib
Ġimpossib le
Ġimp le
Ġi m
Ġim mun
Ġimmun ity
Ġexact ly
Ġdo ub
Ġdoub le
Ġcons ult
Ġallow s
Ġalign ed
ĠWith in
ĠSR CSR
ĠR s
ĠR MG
ĠR FM
ĠRFM OS
ĠPOi OTHERS
ĠP la
ĠPla ce
ĠP at
ĠPat ter
ĠPatter n
ĠODi OTHERS
ĠNWi OTHERS
ĠM B
ĠHi R
ĠHV POD
ĠE mitter
ĠCOi OTHERS
Ġ8 00
Ġ( <
r d
not ch
m ask
fil l
ff ective
eff ective
W ith
VAR OD
V PSTP
USE M
STA MP
RI SK
PSDc nco
NSDc nco
L MARK
IP LVS
F Y
E ffective
DEN T
CI DENT
99 4
79 5
6 75
4 35
03 8
02 88
0 18
Ġutili z
Ġutiliz ed
Ġt in
Ġtin y
Ġst ri
Ġstri ctly
Ġsource s
Ġpro d
Ġprod uct
Ġimple ment
Ġimplement ation
Ġen clo
Ġenclo ure
Ġen c
Ġenc l
Ġencl so
Ġenclso ure
Ġc lamp
Ġc al
Ġcal c
Ġcalc ula
Ġcalcula ted
Ġapp ly
Ġacc umula
Ġaccumula ted
ĠU tili
ĠUtili z
ĠUtiliz ation
ĠS eal
ĠR region
ĠQ R
ĠPWEL c
ĠNWRSTI EN
ĠNWROD S
ĠNWEL c
ĠNP s
ĠM ask
ĠIP TA
ĠIPTA G
ĠF i
ĠFi eld
ĠESDIMP EN
ĠEPMOS c
ĠENMOS c
ĠE PSD
ĠDTCD S
ĠC orrect
ĠCorrect ing
Ġ>= /
Ġ16 5
Ġ" ?
Ġ"? "
ĊĊĠ ĠĊĠ
un ction
space s
se al
s can
scan ner
mu lti
multi ple
ic ide
c on
al icide
W LCSP
VSS DMY
VDD DMY
V SE
SRDOD x
S y
S x
S alicide
RM G
R ing
R NWEL
P FD
O F
OF F
NP WR
NC apNTN
N SRM
EN S
C ode
C SE
AN ODE
16 8
13 0
014 95
014 7
001 6
+ /
ĠĠĠ ĊĊĠĠ
Ġwidth s
Ġviolation s
Ġrem ind
Ġremind er
Ġpr of
Ġprof i
Ġprofi le
Ġpr Boundary
Ġm ight
Ġk n
Ġkn ow
Ġknow s
Ġj ust
Ġg ap
Ġf ind
Ġf al
Ġfal se
Ġde sig
Ġdesig ner
Ġconserv a
Ġconserva tively
Ġcompa ring
Ġcompa red
Ġb ec
Ġbec a
Ġbeca use
ĠZ MOS
ĠY ou
ĠX HV
ĠWith out
ĠW ar
ĠWar m
ĠWarm ing
ĠW LET
ĠSL RS
ĠS tra
ĠStra ined
ĠS i
ĠNW s
ĠMV HV
ĠM POL
ĠM DLDD
ĠL og
ĠLog ic
ĠL MIN
ĠH VI
ĠHVI I
ĠFLA T
ĠFLAT TEN
ĠFG CT
ĠF ULL
ĠEMB FH
ĠE GRMV
ĠCOIN CIDENT
ĠCG CT
ĠCG CAP
ĠC SCT
ĠB ig
Ġ4 0000
Ġ ig
Ġig no
Ġigno red
x SRM
pr b
prb oundary
co vered
Use prboundary
Use prBoundary
R UN
POLY M
POLYM IDE
HVDN P
HVD PP
FHV PW
08 0
% ]
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
Ġsh o
Ġsho ter
Ġsetting s
Ġpar ame
Ġparame ter
Ġp ri
Ġpri or
Ġprior ity
Ġp ic
Ġpic up
Ġother wise
Ġother s
Ġj unction
Ġin form
Ġinform ation
Ġhigh er
Ġde te
Ġdete c
Ġdetec ted
Ġconf li
Ġconfli ct
Ġal way
Ġalway s
ĠPP Ui
ĠNP Ui
ĠHV CO
ĠHP STP
ĠD O
Ġ> ^
Ġ((((((( (
ef ault
VI SO
P HIA
O n
NH I
NHI A
ND D
I f
DE P
D efault
CT MDMY
33 000
26 000
12 9
Ġp ls
Ġex a
Ġexa mp
Ġexamp le
Ġe LVT
ĠP IPLVS
ĠK OZ
ĠFOD WLOX
ĠAP u
Ġ ;
] }
N on
Ġle ft
Ġca se
ĠFI LL
ĠDi ode
Ġ6 7
ex ist
con tact
b ottom
RR TE
OD IN
M VISO
ĠĠĠ ĊĊĠ
Ġs ec
Ġsec ond
Ġr ight
Ġperi m
Ġpatterns fill
Ġpatternsfill ing
Ġlow e
Ġlowe st
Ġl ink
Ġg rea
Ġgrea ter
Ġdelta V
ĠRE CT
ĠP ick
ĠPick up
ĠPickup H
ĠPickupH ole
ĠHV DN
ĠConn ect
Ġ1 1
Ġ DNUT
n f
al f
[ !!
ST RAP
S quare
NON W
MetalFuse LinkOPC
HV ZMOS
HV F
DCO DMY
C ut
25 00
! ~(
Ġthe y
Ġseal r
Ġsealr ind
Ġs ensitive
Ġde pend
Ġde g
Ġdeg rad
Ġdegrad ation
Ġcontain s
ĠS ensitive
ĠR ING
ĠPMET R
ĠNXX HP
ĠLay er
ĠHVOX i
ĠCB x
ĠC m
ĠCm ula
ĠCmula tive
}} ]
b le
T D
ST CAP
PO A
M ATCH
CT CDMY
C ell
8 388
8388 608
67 108
67108 864
6 291
6291 456
3 00
20 4
)*( !~(
ĠĠ ĊĠĠĠ
Ġvi ola
Ġviola ting
Ġs ign
Ġm ess
Ġmess age
Ġincre ments
Ġconcer ning
Ġaddition al
Ġab s
Ġabs ence
Ġa p
Ġap pe
Ġappe ar
ĠWB AP
ĠUBM s
ĠU NI
ĠS um
ĠS tre
ĠStre ss
ĠRe lief
ĠRHOD R
ĠO RS
ĠORS RAM
ĠORSRAM DMY
ĠNo te
ĠN G
ĠMOS F
ĠMOSF ET
ĠM C
ĠL OG
ĠLOG SRAMDMY
ĠC ustomer
ĠCustomer s
ĠC orner
ĠBE VA
Ġ HPL
pec i
peci al
S tepping
S DMY
PR L
OD HG
M M
15 2
)] [
Ġvi ew
Ġlog o
Ġfile s
Ġen closed
Ġdire ct
Ġdirect ory
Ġconnect ing
ĠSum m
ĠSumm ary
ĠS hape
ĠF OB
ĠC ross
Ġ ro
s ection
section al
conn ected
V SR
UBM B
S pecial
PO EX
NXX LP
EL VT
C U
Ġs te
Ġste p
Ġro ut
Ġrout ing
Ġlo c
Ġloc ation
Ġex clu
Ġexclu sion
Ġco in
ĠO r
ĠNPOD inPW
ĠNOT USEM
ĠF LVOD
ĠD elta
ĠCO in
Ġ" -
Ġ HORIZONTAL
window s
u s
m ide
RT LB
PWEL i
P GATE
OD WLOX
NO DNW
NG ATE
L argeNumber
IO LV
HV N
FDI F
D ONUT
A rray
Ġtou ch
Ġr ad
Ġrad i
Ġradi us
Ġ5 00000
Ġ3 00000
w hole
rd b
V PP
S Z
A MBF
2 20
ĠĠĠĠĠĠĠĠ ĠĠ
Ġround ing
ĠSEN SDMY
ĠPSTP cnNoco
ĠPOjog B
ĠP NP
ĠNSTP cnNoco
ĠH RPO
ĠEnclosure d
ĊĊ ĊĠĠĠ
i f
edge AP
a void
a R
TI LE
TE DGE
OU TEDGE
N ode
HVN OD
HV ND
H alf
G ate
FM W
ET CAP
BO X
B BOX
ĠĠĠĠ ĠĠĠĊĠ
ĠĠĠĠ ĠĊĠĠ
Ġtarget ing
Ġt ra
Ġtra ce
Ġr isk
Ġoption s
Ġc u
ĠCD U
ĠC P
ĠCP UM
ĠAn tic
ĠAntic i
ĠAntici pa
ĠAnticipa te
Ġ4 2
Ġ15 00
ol erance
b oth
VER TI
VERTI C
VERTIC AL
TD UBM
S N
SN DMY
RR DMY
P B
F O
F CTCDMY
ESD DMY
CT CCG
12 1
ĠĠ ĊĠĠĠĠĠĠĠĠĠ
ĠĠ ĊĊĊĊĊĠ
ĠĊĠĠĠĠĠĠĠĠĠ ĠĠ
Ġs up
Ġpoly mide
Ġcoin cided
ĠV AL
ĠVAL ID
ĠRecommend ation
ĠRH RI
ĠR ule
ĠPSTP cnco
ĠPPOD inPW
ĠP as
ĠPas si
ĠPassi v
ĠPassiv ation
ĠOPC R
ĠODS pace
ĠNSTP cnco
ĠL PWELi
ĠK e
ĠHole s
ĠHoles With
ĠHolesWith OD
ĠHV PS
ĠHVPS UBM
ĠHVPSUBM W
ĠG Merge
ĠFHV PW
ĠF LIP
ĠB ULK
Ġ1 16
Ġ UM
in f
exp anding
al one
X HV
WB x
W LET
VN STP
UBM DN
SL RS
R OTATE
MG L
MD LDD
MB FH
M POL
L MIN
I R
HVI I
FG CT
F LVOD
EG D
E MBFH
E GRMV
CG D
CG CT
CG CAP
CBM FINAL
CA SE
C SD
C SCT
B E
7 75
39 5
11 2
11 1
). )
(( ((
Ġz er
Ġzer o
Ġen abled
ĠW aive
ĠPSDc nNoco
ĠNSDc nNoco
ĠNE G
ĠM er
ĠMer ge
ĠHVD P
ĠFM SLDD
ĠConn ection
ĠA MBF
Ġ3 000
t mp
per i
i tion
NXX HP
BDTCD DN
15 00
Ġy our
Ġsup p
Ġne w
Ġinters ection
ĠSSD a
ĠRec ogn
ĠRecogn ition
ĠNP N
ĠKe lv
ĠKelv in
ĠFM DLDD
ĠDV R
ĠD RM
ĊĊ ĊĊĠĠ
|> _
ir c
irc le
e red
WWGC i
Volt age
SE G
PLDD i
OUT TER
NWGC i
NLDD i
IP W
FC x
D elta
CO EN
BE VA
B ER
' )]
" )
Ġw on
Ġsimultane ous
Ġsimultaneous ly
Ġmeet ing
ĠS pacing
ĠPOLY G
ĠPOLYG ON
ĠOther s
ĠIO ESDDMY
ĠFM W
ĠD F
ĠC ETCAP
ĠBJT SNDMY
ott k
ottk y
ex clude
SOL DE
SOLDE R
SCH E
SCHE ME
HV LN
EXTENT S
D efinition
CON T
B ALL
Ac tive
AB S
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġ{{ (
Ġw i
Ġwi re
Ġunder ne
Ġunderne a
Ġundernea th
Ġti e
Ġsel ection
Ġres erv
Ġreserv ed
Ġrequi re
Ġrequire ment
Ġre qu
Ġrequ es
Ġreques ted
Ġoff ered
Ġma k
Ġmak ing
Ġm o
Ġmo st
Ġkeep out
Ġis o
Ġf ac
Ġfac ing
Ġc op
Ġcop per
Ġc entral
ĠUn silicided
ĠSR MDMY
ĠS DE
ĠP I
ĠPI TCH
ĠOD L
ĠH NSTP
ĠH FCTCDMY
ĠG O
ĠGO OG
ĠFHV SR
ĠF O
ĠF NW
ĠF CG
ĠDM y
Ġ4 6
tra ck
re at
g ener
gener al
b ut
VTN i
VIA i
TI GH
TIGH TEN
O LA
OLA TE
L ess
HP STP
G reat
FDIF VER
A but
- (
) )*!!
( ^
( ))*!!
' '
Ġextend ed
Ġcoun t
Ġcan not
Ġc orre
Ġcorre s
Ġcorres p
Ġcorresp ond
Ġcorrespond ing
ĠV MGL
ĠS ch
ĠSch ottky
ĠR FP
ĠM TOP
ĠHV NWi
ĠH PACT
ĠH NACT
t olerance
re D
reD O
reDO SRM
on ut
b ump
] },
Z GATE
WC Ui
W AL
WAL i
VIAy u
TH ODE
T CAP
Seal ring
OD R
O FUSE
LV NW
HVI SO
GE N
E nd
DUM GEN
DE CAP
CC O
CA THODE
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġsol der
Ġre a
Ġrea pectively
Ġinteract ing
Ġcon ve
Ġconve x
Ġbe y
Ġbey ond
Ġball s
ĠST AR
ĠSTAR P
ĠPOLY s
ĠP CC
ĠL P
ĠHV PSTP
ĠHV NSTP
ĠH NTAP
ĠG round
ĠF RH
ĠCT COD
ĠCG PO
ĠC ENTRAL
Ġ2 45
Ġ245 1
Ġ- (
po edge
ne w
g h
SL OPE
RC GC
R LH
NOT USEM
In side
ION W
HVPW DIO
HVNW DIO
F OR
BJT PO
ALL x
ĠĠĠĠĠ ĊĊĠ
ĠĠ ĊĊĊ
ĠĊĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
Ġa v
Ġav ai
Ġavai la
Ġavaila ble
ĠVI OLATE
ĠV HVLN
ĠTRI ANGLE
ĠS t
ĠS hort
ĠRW n
ĠP o
ĠP L
ĠMin mum
ĠIs olation
ĠD S
ĠDS DIO
ĠCTC PICKUP
ĠCOOD inf
ĠB VDMY
Ġ@ {
Ġ8 1
Ġ((((( (
Ġ test
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
WI DE
N et
MD LD
FHV SR
CTC PICKUP
B B
9 4
")) )]
Ġta ble
Ġsupp ort
Ġne i
Ġnei boring
Ġd onut
Ġd ia
Ġdia meter
Ġd gree
Ġcont a
Ġconta ined
Ġbump s
Ġb ottom
ĠU N
ĠUN BA
ĠUNBA LA
ĠUNBALA NC
ĠUNBALANC E
ĠT wo
ĠT ri
ĠS V
ĠRR RE
ĠRRRE POS
ĠR I
ĠRI SK
ĠPo int
ĠOR ING
ĠON RU
ĠONRU LE
ĠO b
ĠOb li
ĠObli qu
ĠObliqu e
ĠO TH
ĠOTH ER
ĠN I
ĠI RING
ĠHV RPO
ĠH BUTT
ĠGMerge W
ĠGMerge B
ĠCT CDMY
ĠCOin HVOD
ĠCOin ESF
ĠCBD x
ĠAn ode
Ġ6 1
Ġ4 94
Ġ2 78
Ġ1 44
Ġ- ^
Ġ IONW
Ġ $
ĊĊĊ ĊĠĠĠ
umula te
si c
m f
c umulate
ac cumulate
] ]
VN OD
V PMOS
V BUTT
T otal
T RA
TRA CE
T OT
TOT AL
REC IS
RECIS ION
P RECISION
NO VSS
N IOLV
N E
MG POVER
LE SS
K OZ
F WLOX
F OB
EDGE C
C ircle
C M
5 54
4 32
19 5
17 33
12 16
+ (
) <
) )/
Ġm ax
Ġcou l
Ġcoul dn
Ġcomplete ly
ĠW W
ĠT D
ĠSTI TCAP
ĠST CAP
ĠSRM N
ĠSR MP
ĠRING MOS
ĠRFP P
ĠPPOD R
ĠOD DECAP
ĠNWRSTI R
ĠNP reDOSRM
ĠNI LD
ĠNE OFUSE
ĠMG PO
ĠL PACT
ĠL NACT
ĠFM CHIP
ĠF ig
ĠF WCUi
ĠF WALi
ĠDM u
ĠDI LVS
ĠDCO i
ĠCTM i
ĠCG DUMGEN
ĠCBM i
ĠC U
ĠBJT TDMY
Ġ= (
Ġ7 7
Ġ6 6
Ġ5 2
Ġ4 4
Ġ1 11
Ġ((((((( ((
ĊĠĠĠ ĊĠ
v ar
var actor
rd l
ne l
n y
k ip
kip Boundary
han nel
WI RE
VN ACT
V RW
V PACT
S kipBoundary
P DIO
N VN
Inter connection
HV OX
HI R
CO VER
CG PO
C hannel
B VDMY
A ny
8 6
7 3
02 4
00 8
')] (
ĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĊĠ ĠĠĠ
ĠĠĠĊĠ ĠĊĠĠĊĠ
ĠĠĠĊĠ ĠĊĠ
ĠĊĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġzone as
Ġzoneas sembly
Ġth ro
Ġthro u
Ġthrou gh
Ġsupp or
Ġsuppor ted
Ġst agger
Ġre tre
Ġretre at
Ġretreat ment
Ġpro b
Ġprob a
Ġproba bility
Ġover all
Ġnon ACT
Ġin s
Ġdi m
Ġch ck
Ġc ircle
Ġbar must
ĠT I
ĠTI LE
ĠSRDPO R
ĠRV x
ĠOther wise
ĠO SE
ĠM D
ĠMD LD
ĠINTE R
ĠHV HVNW
ĠF IND
ĠF CB
ĠEHVT P
ĠEHVT N
ĠDUM MY
ĠDM z
ĠDEP VTN
ĠD rian
ĠD ou
ĠDou ble
ĠCO I
ĠCOI SRAM
ĠC R
ĠCR NXXLP
ĠB lock
ĠB A
ĠBA SE
Ġ6 8
Ġ16 7
Ġ1 35
Ġ ĊĊĠĠĠ
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
} >=
x e
vi rtual
p oly
od ule
od es
m ax
lo cal
h alf
V UD
T olerance
S LD
PACT x
P ls
P H
NP Ui
N SD
LE xe
Gate LExe
FC G
F NW
CT COD
CT CCO
38 00
35 1
3 100
/ ,
. =
) >=
Ġs d
Ġres istance
Ġle g
Ġconnn ect
ĠSt agger
ĠP MDMY
ĠM odule
ĠLV DNW
ĠINTER RACT
ĠHV PP
ĠF WLOX
ĠCTC RPO
ĠCT CCO
ĠALL OD
Ġ>= ^
Ġ= ^
Ġ ge
Ġge om
Ġgeom et
Ġgeomet ri
Ġgeometri es
} ).
u T
side s
s d
end cap
a mg
X OR
V t
V MGL
RH RI
P re
NO HV
H FCTCDMY
GR OW
FM SLDD
F RPO
F LOAT
DNW S
DEVICE S
CTC RPO
C ETCAP
8 7
3 15
12 5
(( (
( !
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĊĊĠ
ĠĠĠĊĠ ĠĠĠĠ
ĠĊĠ ĠĠĠĠĠĠ
Ġ{@ {
Ġuni for
Ġunifor mi
Ġuniformi ty
Ġun st
Ġunst able
Ġun int
Ġunint en
Ġuninten tion
Ġunintention al
Ġun b
Ġunb ro
Ġunbro ken
Ġt r
Ġstack ing
Ġset up
Ġseg ment
Ġre q
Ġreq ured
Ġre al
Ġo k
Ġnotch es
Ġn er
Ġner gh
Ġnergh boring
Ġins u
Ġinsu de
Ġf an
Ġfan out
Ġext ent
Ġextent sion
Ġequi la
Ġequila ter
Ġequilater al
Ġdi odes
Ġco exist
Ġc er
Ġcer t
Ġcert ain
Ġb a
Ġba se
Ġact ing
Ġ[ ^
ĠV ss
ĠT op
ĠTop Mu
ĠTopMu W
ĠTopMuW hole
ĠTopMuWhole D
ĠTopMuWholeD en
ĠSRAM PS
ĠSRAMPS G
ĠSRAMPSG T
ĠS ili
ĠSili con
ĠRe qui
ĠRequi red
ĠRFP MOS
ĠRF NMOS
ĠR T
ĠRT LB
ĠR OUND
ĠPoly mide
ĠPA VT
ĠPAVT P
ĠOD c
ĠOD R
ĠO L
ĠNOT USE
ĠMV PP
ĠMV NP
ĠMFUSELINK OPC
ĠM SLD
ĠL ow
ĠL g
ĠI ds
ĠIds at
ĠH orizontal
ĠH NONWR
ĠH L
ĠH D
ĠG ated
ĠF la
ĠFla s
ĠFlas h
ĠF RES
ĠF NWRSTI
ĠEG CT
ĠDMy EXCL
ĠCu B
ĠCuB OL
ĠCOin f
ĠCOPO inf
ĠCGPO CT
ĠCBM FINAL
ĠC EC
ĠC C
ĠBa sic
Ġ<= ^
Ġ7 3
Ġ68 07
Ġ45 0
Ġ* }
Ġ((((((( ((((
Ġ((((((((((( ((((
Ġ((((((((((((((( (((
Ġ HO
}} }.
}] ]
t ow
tow ard
r in
rin sic
nder fill
int rinsic
ind i
indi vidual
eck ed
e parated
direction al
al low
X C
WB i
VAL ID
V POD
V NMOS
V HVLN
T IVE
St agger
STI TCAP
SRM N
SRAM P
SR MP
SR MDMY
SEN SDMY
SEALRING i
S eparated
S cribe
RING MOS
R OUND
PSTP cnco
PSTP cnNoco
PSDc nNoco
PROP E
P IPLVS
P BR
ODE XC
OD DECAP
O ut
NSTP cnco
NSTP cnNoco
NSDc nNoco
NP reDOSRM
NI LD
NE OFUSE
NE I
N EG
M T
L ine
L g
Inter act
ISO x
IO ESDDMY
IC RO
HVOX i
HV NWi
FMONOS DMY
FM DLDD
FM CHIP
FC i
F WCUi
F WALi
F RES
F NWRSTI
F EN
EG CT
DS DIO
DI LVS
D COi
Ch ecked
CTM i
CI CAP
CGPO CT
CG DUMGEN
CC ET
CBM i
BJT SNDMY
A A
554 432
33 554432
3 25
25 2
18 7
1000 000
) })
'' '
% ,
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĊĊ
ĠĊĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĊĠĠ Ċ
Ġ{{{{{{{ {{
Ġz on
Ġzon es
Ġw or
Ġwor k
Ġtr ia
Ġtria gle
Ġs in
Ġsin ce
Ġs ap
Ġsap ce
Ġpro per
Ġpla c
Ġplac ing
Ġne g
Ġneg ative
Ġn ow
Ġid ent
Ġident cal
Ġf ur
Ġfur ther
Ġex it
Ġdoesn t
Ġdo e
Ġdoe an
Ġcover d
Ġcon di
Ġcondi t
Ġcondit on
Ġconditon al
Ġconditonal ly
Ġcom b
Ġcomb ined
Ġch ec
Ġc lo
Ġb t
Ġas p
Ġasp ect
Ġal rea
Ġalrea d
Ġalread y
Ġacc pe
Ġaccpe ted
Ġ[! ~(
ĠVTULP s
ĠVTULN s
ĠVTLP s
ĠVTLN s
ĠVTHP s
ĠVTHN s
ĠTSV s
ĠPWEL n
ĠPO c
ĠPACT x
ĠOD x
ĠNW n
ĠMV MOS
ĠIN ET
ĠINET RACT
ĠHVPP Ui
ĠHV NPUi
ĠG lo
ĠGlo b
ĠGlob al
ĠF LO
ĠFLO OR
ĠE dge
ĠEdge s
ĠE BR
ĠD onut
ĠCOM M
ĠCOMM ON
ĠCB R
ĠB CO
ĠA V
Ġ= ((
Ġ2 44
Ġ1 78
Ġ1 36
Ġ1 30
Ġ+ /
Ġ+/ -
{{ {
w ard
via x
s en
re lated
re al
ip h
iph er
ipher al
ia s
ex t
er tical
di e
d at
dat a
ch ip
c ide
a fter
VT x
VRW STP
VPP Ui
VI OLATE
V NPUi
V GATE
TRI ANGLE
RRTE ON
RRTEON R
PR BOUNDARY
PO EN
P MDMY
OS E
OD x
NO FMONOSCELL
N f
MV PP
MV NP
MG PO
LAY E
H ALF
F IND
ER G
EB R
E ither
D R
CTC FMONOSCELL
CT CCET
CHECK x
BJT TDMY
BCO R
9 8
9 75
8 25
33 0
24 4
2 15
14 3
13 2
12 50
0 33
. >=
- ^
, ^
). (
)) }
' ,
" )),
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĊĠ
ĠĠĠĠ Ċ
ĠĊĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĊĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
Ġ{{{{{{{ {
Ġ{ "
Ġz a
Ġza pping
Ġvi o
Ġvio late
Ġunder fill
Ġun w
Ġunw an
Ġunwan ted
Ġun related
Ġum x
Ġsup pre
Ġsuppre ss
Ġsu s
Ġstra ined
Ġs ub
Ġsub st
Ġsubst ra
Ġsubstra ct
Ġs a
Ġsa ti
Ġsati s
Ġsatis fied
Ġredundan cy
Ġr a
Ġra ther
Ġpro po
Ġpropo s
Ġpropos al
Ġpa th
Ġpa ra
Ġpara si
Ġparasi tic
Ġneed ed
Ġmin um
Ġminum um
Ġmi c
Ġmic ro
Ġm old
Ġmold ing
Ġm odes
Ġm er
Ġmer g
Ġlea d
Ġins die
Ġi ts
Ġfor ward
Ġfor ce
Ġfi x
Ġf ree
Ġexp cept
Ġenclosure d
Ġdo sen
Ġdis ch
Ġdisch arge
Ġdire c
Ġdirec d
Ġdirecd tion
Ġdeter m
Ġdeterm ined
Ġde grees
Ġcoin cide
Ġclo sed
Ġchec h
Ġchech ing
Ġc orrect
Ġc lea
Ġclea ran
Ġclearan ce
Ġbu il
Ġbuil d
Ġbe en
Ġb ip
Ġbip ola
Ġbipola r
Ġassign ed
Ġab n
Ġabn or
Ġabnor m
Ġabnorm al
ĠW aived
ĠVTULP ia
ĠVTULN ia
ĠVTU H
ĠVTLP ia
ĠVTLN ia
ĠVTHP ia
ĠVTHN ia
ĠV ertical
ĠU nderfill
ĠU ltra
ĠSt ack
ĠStack ing
ĠSTRAP s
ĠS h
ĠSh ottky
ĠS SDc
ĠR Rule
ĠPSTP u
ĠPP ia
ĠPO ia
ĠP er
ĠPer ipheral
ĠODR uT
ĠOD ia
ĠO K
ĠO CT
ĠNXX LP
ĠNW ia
ĠNSTP u
ĠNP ia
ĠNOTUSE PO
ĠNOTUSE OD
ĠNEG TIVE
ĠMu lti
ĠMV PO
ĠMV OD
ĠM ICRO
ĠM ERG
ĠL ong
ĠKe ep
ĠJ unction
ĠHV NP
ĠHL PW
ĠHL NW
ĠH RE
ĠHRE P
ĠH BM
ĠG R
ĠF S
ĠF L
ĠF IC
ĠEn close
ĠEn clo
ĠEnclo u
ĠEnclou sure
ĠERR DPO
ĠCTC NW
ĠCTC FMONOSCELL
ĠCO DMY
ĠC oll
ĠColl ect
ĠC ha
ĠCha p
ĠChap ter
ĠC a
ĠCa pacit
ĠCapacit ance
ĠB ulk
ĠB ond
ĠB ias
ĠAP n
Ġ@ (
Ġ8 2
Ġ75 00
Ġ7 72
Ġ7 6
Ġ76 00
Ġ7 4
Ġ6 200
Ġ3 30
Ġ3 26
Ġ28 88
Ġ2888 8
Ġ2 25
Ġ1 90
Ġ1 48
Ġ1 3
Ġ1 10
Ġ te
Ġte mp
Ġtemp er
Ġtemper at
Ġtemperat ure
Ġ own
Ġ POSI
ĠPOSI TIVE
Ġ ...
Ġ #
ĊĠĠĠ ĊĠĠĠĊĠ
}} }]
}} },
ummy Rule
ummyRule ODi
si tive
ro w
p well
p itch
of f
off ered
n well
k V
exc et
excet p
ex tension
e vice
can not
c ad
b gB
b gA
ab ut
]. (
] .)
X T
WAIVE D
W b
W a
V P
U nderfill
T s
SU RR
SURR OUND
STACK ING
SQ UARE
SH ARE
SDI E
S DE
RES POR
RES ODR
REGION x
RE SR
R ef
R G
PSTP u
PP S
ON LY
O nly
O VP
O K
NSTP u
NPOD R
NP PR
NOT USE
NOT OD
N UBM
N AT
NAT IVE
M SLD
M ICRO
LV PO
L VISO
IN SDIE
ICOVL R
HV PMOS
HV NMOS
HV CO
H ig
G row
F RH
F IC
F EX
F CB
F BE
Edge R
EXC EPT
E mpty
DIODE S
DENSITY q
DB x
D ummyRuleODi
D evice
D ensity
CTC PP
CTC NW
CTC NP
COIN CIDENT
CB R
C P
BUTT ING
AP EN
AN R
ALL q
ALL OD
A ll
A H
>= ^
= (
<= ^
: {{{
: (
89 9
7 900
7 400
7 15
6 70
6 200
5 15
48 00
46 9
44 4
4 85
33 5
27 5
25 0
2 45
18 16
16 1
11 6
11 40
04 9
04 7
03 7
03 6
03 4
0 32
. [
, {
+ ).
